# ESMTP LIMITS extension, client RCPTDOMAINMAX Limit
#
# Baseline: no RCPTDOMAINMAX Limit advertised, can send RCPT commands with distinct domains
server PORT_D
220 Hi there
EHLO
250-yeah mate
250 LIMITS MAILMAX=10
MAIL FROM
250 mail cmd good
RCPT TO
250 rcpt cmd 1 good
RCPT TO
250 rcpt cmd 2 good
DATA
352 go ahead
.
250 message received
QUIT
220 bye
****
exim -odi a@a.test.ex b@b.test.ex
****
#
# RCPTDOMAINMAX Limit advertised, exim transport treats as 1
# Client should immediate-retry further MAIL transactions for remaining rcpts
server PORT_D
220 Hi there
EHLO
250-yeah mate
250 LIMITS MAILMAX=10 RCPTDOMAINMAX=100
MAIL FROM
250 mail cmd good
RCPT TO:<a1@a.test.ex>
250 rcpt cmd 1 good
RCPT TO:<a2@a.test.ex>
250 rcpt cmd 2 good
DATA
352 go ahead
.
250 message received
MAIL FROM
250 second mail cmd good
RCPT TO:<b1@b.test.ex>
250 rcpt cmd 1 good
RCPT TO
250 rcpt cmd 2 good
DATA
352 go ahead
.
250 second message received
MAIL FROM
250 third mail cmd good
RCPT TO:<c1@c.test.ex>
250 rcpt cmd 1 good
DATA
352 go ahead
.
250 third message received
QUIT
220 bye
****
exim -odi a1@a.test.ex b1@b.test.ex c1@c.test.ex a2@a.test.ex b2@b.test.ex
****
