Exim version x.yz ....
Hints DB:
configuration file is TESTSUITE/test-config
trusted user
admin user
originator: uid=CALLER_UID gid=CALLER_GID login=CALLER name=CALLER_NAME
sender address = NULL
LOG: smtp_connection MAIN
  SMTP connection from CALLER
SMTP>> 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
smtp_setup_msg entered
SMTP>- ◀flush▶
SMTP<< helo test
SMTP>| 250 myhost.test.ex Hello CALLER at test
SMTP<< mail from:<x@y>
spool directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100 msg_size = 0
log directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100
SMTP>> 250 OK
SMTP<< rcpt to:<one@z>
one in "reject"? no (end of list)
SMTP>> 250 Accepted
SMTP<< rcpt to:<one@z>
rate limit RCPT: delay 0.25 sec
one in "reject"? no (end of list)
SMTP>> 250 Accepted
SMTP<< rcpt to:<one@z>
rate limit RCPT: delay 0.263 sec
one in "reject"? no (end of list)
SMTP>> 250 Accepted
SMTP<< rcpt to:<one@z>
rate limit RCPT: delay 0.276 sec
one in "reject"? no (end of list)
SMTP>> 250 Accepted
SMTP<< rcpt to:<one@z>
rate limit RCPT: delay 0.289 sec
one in "reject"? no (end of list)
SMTP>> 250 Accepted
SMTP<< data
SMTP>> 354 Enter message, ending with "." on a line by itself
>>Headers received:

>>Headers after rewriting and local additions:
 I Message-Id: <E10HmaX-000000005vi-0000@myhost.test.ex>
 F From: x@y
   Date: Tue, 2 Mar 1999 09:44:33 +0000

Data file name: TESTSUITE/spool//input//10HmaX-000000005vi-0000-D
Data file written for message 10HmaX-000000005vi-0000
>>Generated Received: header line
P Received: from CALLER (helo=test)
	by myhost.test.ex with local-smtp (Exim x.yz)
	(envelope-from <x@y>)
	id 10HmaX-000000005vi-0000;
	Tue, 2 Mar 1999 09:44:33 +0000
Writing spool header file: TESTSUITE/spool//input//hdr.10HmaX-000000005vi-0000
Renaming spool header file: TESTSUITE/spool//input//10HmaX-000000005vi-0000-H
Size of headers = sss
LOG: MAIN
  <= x@y U=CALLER P=local-smtp S=sss
created log directory TESTSUITE/spool/log
receive_msg: tidyup
SMTP>| 250 OK id=10HmaX-000000005vi-0000
smtp_setup_msg entered
SMTP<< mail from:<x@y>
rate limit MAIL: delay 1 sec
spool directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100 msg_size = 0
log directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100
SMTP>> 250 OK
SMTP<< rcpt to:<two@z>
two in "reject"? no (end of list)
SMTP>> 250 Accepted
SMTP<< data
SMTP>> 354 Enter message, ending with "." on a line by itself
>>Headers received:

>>Headers after rewriting and local additions:
 I Message-Id: <E10HmaY-000000005vi-0000@myhost.test.ex>
 F From: x@y
   Date: Tue, 2 Mar 1999 09:44:33 +0000

Data file name: TESTSUITE/spool//input//10HmaY-000000005vi-0000-D
Data file written for message 10HmaY-000000005vi-0000
>>Generated Received: header line
P Received: from CALLER (helo=test)
	by myhost.test.ex with local-smtp (Exim x.yz)
	(envelope-from <x@y>)
	id 10HmaY-000000005vi-0000
	for two@z;
	Tue, 2 Mar 1999 09:44:33 +0000
Writing spool header file: TESTSUITE/spool//input//hdr.10HmaY-000000005vi-0000
Renaming spool header file: TESTSUITE/spool//input//10HmaY-000000005vi-0000-H
Size of headers = sss
LOG: MAIN
  <= x@y U=CALLER P=local-smtp S=sss
receive_msg: tidyup
SMTP>| 250 OK id=10HmaY-000000005vi-0000
smtp_setup_msg entered
SMTP<< mail from:<x@y>
rate limit MAIL: delay 2 sec
spool directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100 msg_size = 0
log directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100
SMTP>> 250 OK
SMTP<< quit
SMTP>| 221 myhost.test.ex closing connection
LOG: smtp_connection MAIN
  SMTP connection from CALLER D=qqs closed by QUIT
SMTP>- ◀flush▶
>>>>>>>>>>>>>>>> Exim pid=p1234 (fresh-exec) terminating with rc=0 >>>>>>>>>>>>>>>>
Exim version x.yz ....
Hints DB:
configuration file is TESTSUITE/test-config
trusted user
admin user
originator: uid=CALLER_UID gid=CALLER_GID login=CALLER name=CALLER_NAME
sender address = CALLER@myhost.test.ex
host in hosts_connection_nolog? no (option unset)
LOG: smtp_connection MAIN
  SMTP connection from [1.2.3.4]
host in host_lookup? no (option unset)
host in host_reject_connection? no (option unset)
host in sender_unqualified_hosts? no (option unset)
host in recipient_unqualified_hosts? no (option unset)
host in helo_verify_hosts? no (option unset)
host in helo_try_verify_hosts? no (option unset)
host in helo_accept_junk_hosts? no (option unset)
SMTP>> 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
smtp_setup_msg entered
SMTP>- ◀flush▶
SMTP<< helo test
test in helo_lookup_domains?
 list element: @
 list element: @[]
test in helo_lookup_domains? no (end of list)
SMTP>| 250 myhost.test.ex Hello test [1.2.3.4]
SMTP<< mail from:<x@y>
spool directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100 msg_size = 0
log directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100
SMTP>> 250 OK
SMTP<< rcpt to:<one@z>
processing inline ACL "deny"
check local_parts = reject
one in "reject"?
 list element: reject
one in "reject"? no (end of list)
deny: condition test failed in inline ACL
processing inline ACL "accept"
accept: condition test succeeded in inline ACL
end of inline ACL: ACCEPT
SMTP>> 250 Accepted
SMTP<< rcpt to:<one@z>
host in smtp_ratelimit_hosts?
 list element: 
 list element: V4NET.9.8.7
host in smtp_ratelimit_hosts? no (end of list)
processing inline ACL "deny"
check local_parts = reject
one in "reject"?
 list element: reject
one in "reject"? no (end of list)
deny: condition test failed in inline ACL
processing inline ACL "accept"
accept: condition test succeeded in inline ACL
end of inline ACL: ACCEPT
SMTP>> 250 Accepted
SMTP<< quit
SMTP>| 221 myhost.test.ex closing connection
LOG: smtp_connection MAIN
  SMTP connection from (test) [1.2.3.4] D=qqs closed by QUIT
SMTP>- ◀flush▶
>>>>>>>>>>>>>>>> Exim pid=p1235 (fresh-exec) terminating with rc=0 >>>>>>>>>>>>>>>>
Exim version x.yz ....
Hints DB:
configuration file is TESTSUITE/test-config
trusted user
admin user
originator: uid=CALLER_UID gid=CALLER_GID login=CALLER name=CALLER_NAME
sender address = CALLER@myhost.test.ex
host in hosts_connection_nolog? no (option unset)
LOG: smtp_connection MAIN
  SMTP connection from [V4NET.9.8.7]
host in host_lookup? no (option unset)
host in host_reject_connection? no (option unset)
host in sender_unqualified_hosts? no (option unset)
host in recipient_unqualified_hosts? no (option unset)
host in helo_verify_hosts? no (option unset)
host in helo_try_verify_hosts? no (option unset)
host in helo_accept_junk_hosts? no (option unset)
SMTP>> 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
smtp_setup_msg entered
SMTP>- ◀flush▶
SMTP<< helo test
test in helo_lookup_domains?
 list element: @
 list element: @[]
test in helo_lookup_domains? no (end of list)
SMTP>| 250 myhost.test.ex Hello test [V4NET.9.8.7]
SMTP<< mail from:<x@y>
spool directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100 msg_size = 0
log directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100
SMTP>> 250 OK
SMTP<< rcpt to:<one@z>
processing inline ACL "deny"
check local_parts = reject
one in "reject"?
 list element: reject
one in "reject"? no (end of list)
deny: condition test failed in inline ACL
processing inline ACL "accept"
accept: condition test succeeded in inline ACL
end of inline ACL: ACCEPT
SMTP>> 250 Accepted
SMTP<< rcpt to:<one@z>
host in smtp_ratelimit_hosts?
 list element: 
 list element: V4NET.9.8.7
  host in smtp_ratelimit_hosts? yes (matched "V4NET.9.8.7")
rate limit RCPT: delay 0.25 sec
processing inline ACL "deny"
check local_parts = reject
one in "reject"?
 list element: reject
one in "reject"? no (end of list)
deny: condition test failed in inline ACL
processing inline ACL "accept"
accept: condition test succeeded in inline ACL
end of inline ACL: ACCEPT
SMTP>> 250 Accepted
SMTP<< quit
SMTP>| 221 myhost.test.ex closing connection
LOG: smtp_connection MAIN
  SMTP connection from (test) [V4NET.9.8.7] D=qqs closed by QUIT
SMTP>- ◀flush▶
>>>>>>>>>>>>>>>> Exim pid=p1236 (fresh-exec) terminating with rc=0 >>>>>>>>>>>>>>>>
Exim version x.yz ....
Hints DB:
configuration file is TESTSUITE/test-config
trusted user
admin user
originator: uid=CALLER_UID gid=CALLER_GID login=CALLER name=CALLER_NAME
sender address = NULL
LOG: smtp_connection MAIN
  SMTP connection from CALLER
SMTP>> 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
smtp_setup_msg entered
SMTP>- ◀flush▶
SMTP<< helo test
SMTP>| 250 myhost.test.ex Hello CALLER at test
SMTP<< mail from:<x@y>
spool directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100 msg_size = 0
log directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100
SMTP>> 250 OK
SMTP<< rcpt to:<reject@z>
SMTP>> 550 Administrative prohibition
SMTP>- ◀flush▶
LOG: MAIN REJECT
  U=CALLER F=<x@y> rejected RCPT <reject@z>
SMTP<< rcpt to:<reject@z>
rate limit RCPT: delay 0.25 sec
SMTP>> 550 Administrative prohibition
SMTP>- ◀flush▶
LOG: MAIN REJECT
  U=CALLER F=<x@y> rejected RCPT <reject@z>
SMTP<< rcpt to:<reject@z>
rate limit RCPT: delay 0.263 sec
SMTP>> 550 Administrative prohibition
SMTP>- ◀flush▶
LOG: MAIN REJECT
  U=CALLER F=<x@y> rejected RCPT <reject@z>
SMTP<< rcpt to:<reject@z>
rate limit RCPT: delay 0.276 sec
SMTP>> 550 Administrative prohibition
SMTP>- ◀flush▶
LOG: MAIN REJECT
  U=CALLER F=<x@y> rejected RCPT <reject@z>
SMTP<< rcpt to:<reject@z>
rate limit RCPT: delay 0.289 sec
SMTP>> 550 Administrative prohibition
SMTP>- ◀flush▶
LOG: MAIN REJECT
  U=CALLER F=<x@y> rejected RCPT <reject@z>
SMTP<< rset
SMTP>> 250 Reset OK
SMTP<< mail from:<x@y>
rate limit MAIL: delay 1 sec
spool directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100 msg_size = 0
log directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100
SMTP>> 250 OK
SMTP<< rcpt to:<reject@z>
SMTP>> 550 Administrative prohibition
SMTP>- ◀flush▶
LOG: MAIN REJECT
  U=CALLER F=<x@y> rejected RCPT <reject@z>
SMTP<< rset
SMTP>> 250 Reset OK
SMTP<< mail from:<x@y>
rate limit MAIL: delay 2 sec
spool directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100 msg_size = 0
log directory space = nnnnnK inodes = nnnnn check_space = 10240K inodes = 100
SMTP>> 250 OK
SMTP<< quit
SMTP>| 221 myhost.test.ex closing connection
LOG: smtp_connection MAIN
  SMTP connection from CALLER D=qqs closed by QUIT
SMTP>- ◀flush▶
>>>>>>>>>>>>>>>> Exim pid=p1237 (fresh-exec) terminating with rc=0 >>>>>>>>>>>>>>>>
