# local part prefix
need_ipv4
#
exim -odi page+ux
Some more message text.
****
server PORT_S
220 Server ready
EHLO
250 OK
MAIL FROM
250 OK
RCPT TO
250 OK
DATA
300 go ahead
.
250 OK
QUIT
250 OK
****
server PORT_S
220 Server ready
EHLO
250 OK
MAIL FROM
250 OK
RCPT TO
250 OK
DATA
300 go ahead
.
250 OK
QUIT
250 OK
****
exim -odi Userx-S@Test.Ex
More text.
****
