
**** SMTP testing session as if from host V4NET.9.8.7
**** This is not for real!

220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello test [V4NET.9.8.7]
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbF-000000005vi-0000

**** SMTP testing: that is not a real message id!

221 myhost.test.ex closing connection

**** SMTP testing session as if from host V4NET.9.8.7
**** This is not for real!

220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello test [V4NET.9.8.7]
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbG-000000005vi-0000

**** SMTP testing: that is not a real message id!

221 myhost.test.ex closing connection

**** SMTP testing session as if from host V4NET.9.8.7
**** This is not for real!

220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello test [V4NET.9.8.7]
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbH-000000005vi-0000

**** SMTP testing: that is not a real message id!

221 myhost.test.ex closing connection

**** SMTP testing session as if from host V4NET.9.8.7
**** This is not for real!

220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello test [V4NET.9.8.7]
250 OK
451 forcibly deferred
250 Accepted
550 forcibly dropped

**** SMTP testing session as if from host V4NET.9.8.7
**** This is not for real!

220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello test [V4NET.9.8.7]
250 OK
451 Temporary local problem - please try later
221 myhost.test.ex closing connection

**** SMTP testing session as if from host V4NET.9.8.7
**** This is not for real!

220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello test [V4NET.9.8.7]
250 OK
250 Accepted
250 Accepted
221 myhost.test.ex closing connection

**** SMTP testing session as if from host V4NET.9.8.7
**** This is not for real!

220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello test [V4NET.9.8.7]
250 OK
550 host data >A host-specific message<
550 host data >A host-specific message<
550 host data >A host-specific message<
550 host data >A host-specific message<
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello CALLER at test
250 OK
250 Accepted
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaX-000000005vi-0000
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaY-000000005vi-0000
250 OK
250 Accepted
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaZ-000000005vi-0000
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbA-000000005vi-0000
221 myhost.test.ex closing connection

**** SMTP testing session as if from host V4NET.9.8.7
**** This is not for real!

220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello test [V4NET.9.8.7]
250 OK
550 forcibly dropped

**** SMTP testing session as if from host V4NET.9.8.7
**** This is not for real!

220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello test [V4NET.9.8.7]
250 OK
550 forcibly dropped
TTT   sss 10HmaX-000000005vi-0000 <CALLER@test.ex> *** frozen ***
          accept@y
          freeze@y

TTT   sss 10HmaZ-000000005vi-0000 <CALLER@test.ex>
          queue_only@y
          accept@y

Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo test
??? 250
<<< 250 myhost.test.ex Hello test [127.0.0.1]
>>> mail from:<x@y>
??? 250
<<< 250 OK
>>> rcpt to:<accept@y>
??? 250
<<< 250 Accepted
>>> rcpt to:<freeze@y>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> 
>>> Testing
>>> .
??? 250
<<< 250 OK id=10HmbB-000000005vi-0000
>>> mail from:<x@y>
??? 250
<<< 250 OK
>>> rcpt to:<accept@y>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> 
>>> Testing 2
>>> .
??? 250
<<< 250 OK id=10HmbC-000000005vi-0000
>>> mail from:<x@y>
??? 250
<<< 250 OK
>>> rcpt to:<queue_only@y>
??? 250
<<< 250 Accepted
>>> rcpt to:<accept@y>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> 
>>> Testing 3
>>> .
??? 250
<<< 250 OK id=10HmbD-000000005vi-0000
>>> mail from:<x@y>
??? 250
<<< 250 OK
>>> rcpt to:<accept@y>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> 
>>> Testing 4
>>> .
??? 250
<<< 250 OK id=10HmbE-000000005vi-0000
>>> mail from:<x@y>
??? 250
<<< 250 OK
>>> rcpt to:<delay_accept@y>
??? 250
<<< 250 Accepted
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
TTT   sss 10HmaX-000000005vi-0000 <CALLER@test.ex> *** frozen ***
          accept@y
          freeze@y

TTT   sss 10HmaZ-000000005vi-0000 <CALLER@test.ex>
          queue_only@y
          accept@y

TTT   sss 10HmbB-000000005vi-0000 <x@y> *** frozen ***
          accept@y
          freeze@y

TTT   sss 10HmbC-000000005vi-0000 <x@y>
          accept@y

TTT   sss 10HmbD-000000005vi-0000 <x@y>
          queue_only@y
          accept@y

TTT   sss 10HmbE-000000005vi-0000 <x@y>
          accept@y

Connecting to 127.0.0.1 port PORT_D ... connected
??? 550 client disliked
<<< 550 client disliked
???*
Expected EOF read
End of script
