Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-LIMITS
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-PIPELINING
<<< 250-PIPELINING
??? 250 HELP
<<< 250 HELP
>>> mail from:<notsubmit@y>
??? 250
<<< 250 OK
>>> rcpt to:<x@y>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> .
??? 250
<<< 250 OK id=10HmaX-000000005vi-0000
>>> mail from:<a@y>
??? 250
<<< 250 OK
>>> rcpt to:<x@y>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> .
??? 250
<<< 250 OK id=10HmaY-000000005vi-0000
>>> mail from:<>
??? 250
<<< 250 OK
>>> rcpt to:<x@y>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> .
??? 250
<<< 250 OK id=10HmaZ-000000005vi-0000
>>> mail from:<notsubmit@y>
??? 250
<<< 250 OK
>>> rcpt to:<x@y>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Sender: sender@some.where
>>> .
??? 250
<<< 250 OK id=10HmbA-000000005vi-0000
>>> mail from:<a@y>
??? 250
<<< 250 OK
>>> rcpt to:<x@y>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Sender: sender@some.where
>>> .
??? 250
<<< 250 OK id=10HmbB-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<a@y>
??? 250
<<< 250 OK
>>> rcpt to:<x@y>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Sender: sender@some.where
>>> .
??? 250
<<< 250 OK id=10HmbC-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<a@y>
??? 250
<<< 250 OK
>>> rcpt to:<x@y>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Sender: sender@some.where
>>> .
??? 250
<<< 250 OK id=10HmbD-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
10HmaX-000000005vi-0000-H
EXIMUSER EXIM_UID EXIM_GID
<notsubmit@y>
ddddddddd 0
-received_time_usec .uuuuuu
-received_time_complete tttt.uuuuuu
--helo_name rhu.barb
-host_address [127.0.0.1]:9999
-interface_address [127.0.0.1]:10002
-received_protocol esmtp
-body_linecount 0
-max_received_linelength 0
-deliver_firsttime
XX
1
x@y

dddP Received: from [127.0.0.1] (helo=rhu.barb)
	by myhost.test.ex with esmtp (Exim x.yz)
	(envelope-from <notsubmit@y>)
	id 10HmaX-000000005vi-0000
	for x@y;
	Tue, 2 Mar 1999 09:44:33 +0000
10HmaY-000000005vi-0000-H
EXIMUSER EXIM_UID EXIM_GID
<a@y>
ddddddddd 0
-received_time_usec .uuuuuu
-received_time_complete tttt.uuuuuu
--helo_name rhu.barb
-host_address [127.0.0.1]:9999
-interface_address [127.0.0.1]:10002
-received_protocol esmtp
-body_linecount 0
-max_received_linelength 0
-deliver_firsttime
XX
1
x@y

dddP Received: from [127.0.0.1] (helo=rhu.barb)
	by myhost.test.ex with esmtp (Exim x.yz)
	(envelope-from <a@y>)
	id 10HmaY-000000005vi-0000
	for x@y;
	Tue, 2 Mar 1999 09:44:33 +0000
054I Message-Id: <E10HmaY-000000005vi-0000@myhost.test.ex>
dddF From: a@y
038  Date: Tue, 2 Mar 1999 09:44:33 +0000
10HmaZ-000000005vi-0000-H
EXIMUSER EXIM_UID EXIM_GID
<>
ddddddddd 0
-received_time_usec .uuuuuu
-received_time_complete tttt.uuuuuu
--helo_name rhu.barb
-host_address [127.0.0.1]:9999
-interface_address [127.0.0.1]:10002
-received_protocol esmtp
-body_linecount 0
-max_received_linelength 0
-deliver_firsttime
XX
1
x@y

dddP Received: from [127.0.0.1] (helo=rhu.barb)
	by myhost.test.ex with esmtp (Exim x.yz)
	id 10HmaZ-000000005vi-0000
	for x@y;
	Tue, 2 Mar 1999 09:44:33 +0000
054I Message-Id: <E10HmaZ-000000005vi-0000@myhost.test.ex>
038  Date: Tue, 2 Mar 1999 09:44:33 +0000
10HmbA-000000005vi-0000-H
EXIMUSER EXIM_UID EXIM_GID
<notsubmit@y>
ddddddddd 0
-received_time_usec .uuuuuu
-received_time_complete tttt.uuuuuu
--helo_name rhu.barb
-host_address [127.0.0.1]:9999
-interface_address [127.0.0.1]:10002
-received_protocol esmtp
-body_linecount 0
-max_received_linelength 25
-deliver_firsttime
XX
1
x@y

dddP Received: from [127.0.0.1] (helo=rhu.barb)
	by myhost.test.ex with esmtp (Exim x.yz)
	(envelope-from <notsubmit@y>)
	id 10HmbA-000000005vi-0000
	for x@y;
	Tue, 2 Mar 1999 09:44:33 +0000
dddS Sender: sender@some.where
10HmbB-000000005vi-0000-H
EXIMUSER EXIM_UID EXIM_GID
<a@y>
ddddddddd 0
-received_time_usec .uuuuuu
-received_time_complete tttt.uuuuuu
--helo_name rhu.barb
-host_address [127.0.0.1]:9999
-interface_address [127.0.0.1]:10002
-received_protocol esmtp
-body_linecount 0
-max_received_linelength 25
-deliver_firsttime
XX
1
x@y

dddP Received: from [127.0.0.1] (helo=rhu.barb)
	by myhost.test.ex with esmtp (Exim x.yz)
	(envelope-from <a@y>)
	id 10HmbB-000000005vi-0000
	for x@y;
	Tue, 2 Mar 1999 09:44:33 +0000
ddd* Sender: sender@some.where
054I Message-Id: <E10HmbB-000000005vi-0000@myhost.test.ex>
dddF From: a@y
038  Date: Tue, 2 Mar 1999 09:44:33 +0000
10HmbC-000000005vi-0000-H
EXIMUSER EXIM_UID EXIM_GID
<a@y>
ddddddddd 0
-received_time_usec .uuuuuu
-received_time_complete tttt.uuuuuu
--helo_name rhu.barb
-host_address [127.0.0.1]:9999
-interface_address [127.0.0.1]:10002
-received_protocol esmtp
-body_linecount 0
-max_received_linelength 25
-deliver_firsttime
XX
1
x@y

dddP Received: from [127.0.0.1] (helo=rhu.barb)
	by myhost.test.ex with esmtp (Exim x.yz)
	(envelope-from <a@y>)
	id 10HmbC-000000005vi-0000
	for x@y;
	Tue, 2 Mar 1999 09:44:33 +0000
dddS Sender: sender@some.where
054I Message-Id: <E10HmbC-000000005vi-0000@myhost.test.ex>
dddF From: a@y
038  Date: Tue, 2 Mar 1999 09:44:33 +0000
10HmbD-000000005vi-0000-H
EXIMUSER EXIM_UID EXIM_GID
<a@y>
ddddddddd 0
-received_time_usec .uuuuuu
-received_time_complete tttt.uuuuuu
--helo_name rhu.barb
-host_address [127.0.0.1]:9999
-interface_address [127.0.0.1]:10002
-received_protocol esmtp
-body_linecount 0
-max_received_linelength 25
-deliver_firsttime
XX
1
x@y

dddP Received: from [127.0.0.1] (helo=rhu.barb)
	by myhost.test.ex with esmtp (Exim x.yz)
	(envelope-from <a@y>)
	id 10HmbD-000000005vi-0000
	for x@y;
	Tue, 2 Mar 1999 09:44:33 +0000
ddd* Sender: sender@some.where
054I Message-Id: <E10HmbD-000000005vi-0000@myhost.test.ex>
dddF From: SomeName <a@y>
038  Date: Tue, 2 Mar 1999 09:44:33 +0000
