Connecting to ip4.ip4.ip4.ip4 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo [ip4.ip4.ip4.ip4]
??? 250-
<<< 250-myhost.test.ex Hello [ip4.ip4.ip4.ip4] [ip4.ip4.ip4.ip4]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<>
??? 250
<<< 250 OK
>>> rcpt to:<userx@test.ex>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> To: userx@test.ex
>>> 
>>> EHLO [ip4.ip4.ip4.ip4]
>>> .
??? 250
<<< 250 OK id=10HmaX-000000005vi-0000
>>> ehlo [IPV4:ip4.ip4.ip4.ip4]
??? 250-
<<< 250-myhost.test.ex Hello [IPV4:ip4.ip4.ip4.ip4] [ip4.ip4.ip4.ip4]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<>
??? 250
<<< 250 OK
>>> rcpt to:<userx@test.ex>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> To: userx@test.ex
>>> 
>>> EHLO [IPV4:ip4.ip4.ip4.ip4]
>>> .
??? 250
<<< 250 OK id=10HmaY-000000005vi-0000
>>> ehlo ip4.ip4.ip4.ip4
??? 250-
<<< 250-myhost.test.ex Hello ip4.ip4.ip4.ip4 [ip4.ip4.ip4.ip4]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<>
??? 250
<<< 250 OK
>>> rcpt to:<userx@test.ex>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> To: userx@test.ex
>>> 
>>> EHLO ip4.ip4.ip4.ip4
>>> .
??? 250
<<< 250 OK id=10HmaZ-000000005vi-0000
>>> ehlo [V4NET.1.2.3]
??? 250-
<<< 250-myhost.test.ex Hello [V4NET.1.2.3] [ip4.ip4.ip4.ip4]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<>
??? 250
<<< 250 OK
>>> rcpt to:<userx@test.ex>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> To: userx@test.ex
>>> 
>>> EHLO [V4NET.1.2.3]
>>> .
??? 250
<<< 250 OK id=10HmbA-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
