Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> mail from:<x@y.x>
??? 250
<<< 250 OK
>>> rcpt to:<x@test.ex>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> From: Me <x@y.z>
>>> Comment: This was really seen!
>>> To: bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     bad@address;bad@address;bad@address;bad@address;bad@address;bad@address;
>>>     END
>>> .
??? 550
<<< 550 Administrative prohibition
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
