Connecting to ip4.ip4.ip4.ip4 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo test
??? 250
<<< 250 myhost.test.ex Hello test [ip4.ip4.ip4.ip4]
>>> mail from:<x@y.x>
??? 250
<<< 250 OK
>>> rcpt to:<x@test.ex>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> .
??? 250
<<< 250 OK id=10HmaY-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
+++ 1
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo test
??? 250
<<< 250 myhost.test.ex Hello test [127.0.0.1]
>>> mail from:<x@y.x>
??? 250
<<< 250 OK
>>> rcpt to:<x@test.ex>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> .
??? 250
<<< 250 OK id=10HmaZ-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
+++ 1
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo rhubarb
??? 250
<<< 250 myhost.test.ex Hello rhubarb [ip4.ip4.ip4.ip4]
>>> mail from:<x@y.x>
??? 250
<<< 250 OK
>>> rcpt to:<x@test.ex>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> .
??? 250
<<< 250 OK id=10HmbA-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello root at test [V4NET.9.8.7]
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaX-000000005vi-0000
221 myhost.test.ex closing connection

**** SMTP testing session as if from host 192.168.1.2
**** but without any ident (RFC 1413) callback.
**** This is not for real!

220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello root at test [V4NET.9.8.7]
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbB-000000005vi-0000
221 myhost.test.ex closing connection
