Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo abcd\r\nmail from:<userx@test.ex>
??? 554
<<< 554 SMTP synchronization error
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo abcd
??? 250-
<<< 250-myhost.test.ex Hello abcd [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> rset\r\nmail from:<userx@test.ex>\r\nrcpt to:<userx@test.ex>\r\ndata
??? 250
<<< 250 Reset OK
??? 250
<<< 250 OK
??? 250
<<< 250 Accepted
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> the message
>>> .\r\nmail from:<userx@test.ex>
+++ 1
>>> rcpt to:<userx@test.ex>\r\ndata\r\nthe message\r\nsecond line
??? 250
<<< 250 OK id=10HmaX-000000005vi-0000
??? 250
<<< 250 OK
??? 250
<<< 250 Accepted
??? 554
<<< 554 SMTP synchronization error
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo abcd
??? 250
<<< 250 myhost.test.ex Hello abcd [127.0.0.1]
>>> mail from:<userx@test.ex>\r\nrcpt to:<userx@test.ex>
??? 554
<<< 554 SMTP synchronization error
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo abcd
??? 250-
<<< 250-myhost.test.ex Hello abcd [ip4.ip4.ip4.ip4]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250
<<< 250 HELP
>>> mail from:<userx@test.ex>\r\nrcpt to:<userx@test.ex>
??? 554
<<< 554 SMTP synchronization error
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> junk0
??? 500
<<< 500 unrecognized command
>>> junk1\r\njunk2
??? 554
<<< 554 SMTP synchronization error
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo abcd
??? 250-
<<< 250-myhost.test.ex Hello abcd [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> rset\r\nquit
??? 250
<<< 250 Reset OK
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo abcd
??? 250-
<<< 250-myhost.test.ex Hello abcd [ip4.ip4.ip4.ip4]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250
<<< 250 HELP
>>> rset\r\nquit
??? 554
<<< 554 SMTP synchronization error
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo dis.able
??? 250-
<<< 250-myhost.test.ex Hello dis.able [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<userx@test.ex>\r\nrcpt to:<userx@test.ex>\r\ndata\r\nthe message\r\nsecond line
>>> .
??? 250
<<< 250 OK
??? 250
<<< 250 Accepted
??? 354
<<< 354 Enter message, ending with "." on a line by itself
??? 250
<<< 250 OK id=10HmaY-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
>>> helo abcd
??? 554
<<< 554 SMTP synchronization error
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
End of script
