220 mail.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaX-0005vi-00
221 mail.test.ex closing connection
220 mail.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 OK
550-Verification failed for <z@remote>
550-Called:   127.0.0.1
550-Sent:     RCPT TO:<z@remote>
550-Response: 550 Unknown
550 Sender verify failed
221 mail.test.ex closing connection
220 mail.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 OK
250 Accepted
250 Accepted
221 mail.test.ex closing connection
220 mail.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 OK
250 Accepted
250 Accepted
221 mail.test.ex closing connection

******** SERVER ********
Listening on port 1224 ... 
Connection request from [127.0.0.1]
220 Server ready
EHLO mail.test.ex
250 OK
MAIL FROM:<>
250 OK
RCPT TO:<x@remote>
550 Unknown
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [127.0.0.1]
220 Server ready
EHLO mail.test.ex
250 OK
MAIL FROM:<>
250 OK
RCPT TO:<z@remote>
550 Unknown
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [127.0.0.1]
220 Server ready
EHLO mail.test.ex
250 OK
MAIL FROM:<>
250 OK
RCPT TO:<qq@remote>
550 Unknown
QUIT
250 OK
End of script
