Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 mail.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo client.test.ex
??? 250
<<< 250 mail.test.ex Hello client.test.ex [127.0.0.1]
>>> mail from:<x@y>
??? 250
<<< 250 OK
>>> rcpt to:<x@y>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Message.
>>> .
??? 250
<<< 250 OK id=10HmaX-0005vi-00
>>> mail from:<a@b>
??? 250
<<< 250 OK
>>> rcpt to:<x@y>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Message.
>>> .
??? 250
<<< 250 OK id=10HmaY-0005vi-00
>>> quit
??? 221
<<< 221 mail.test.ex closing connection
End of script
