Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<userx@test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<userx@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> DATA
??? 503
<<< 503-All RCPT commands were rejected with this error:
??? 503
<<< 503-Administrative prohibition
??? 503
<<< 503 Valid RCPT command must precede DATA
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo rhu.barb
??? 250
<<< 250 myhost.test.ex Hello rhu.barb [127.0.0.1]
>>> mail from:<userx@test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<userx@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> DATA
??? 503
<<< 503-All RCPT commands were rejected with this error:
??? 503
<<< 503-Administrative prohibition
??? 503
<<< 503 valid RCPT command must precede DATA
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<deny@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> rcpt to:<userx@test.ex>
??? 503
<<< 503 sender not yet given
>>> DATA
??? 503
<<< 503-All RCPT commands were rejected with this error:
??? 503
<<< 503-503 sender not yet given
??? 503
<<< 503 Valid RCPT command must precede DATA
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo rhu.barb
??? 250
<<< 250 myhost.test.ex Hello rhu.barb [127.0.0.1]
>>> mail from:<deny@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> rcpt to:<userx@test.ex>
??? 503
<<< 503 sender not yet given
>>> DATA
??? 503
<<< 503-All RCPT commands were rejected with this error:
??? 503
<<< 503-503 sender not yet given
??? 503
<<< 503 valid RCPT command must precede DATA
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<userx@test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<userx@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> rcpt to:<ph11@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> rcpt to:<ph12@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> DATA
??? 503
<<< 503-All RCPT commands were rejected with this error:
??? 503
<<< 503-Administrative prohibition
??? 503
<<< 503 Valid RCPT command must precede DATA
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo rhu.barb
??? 250
<<< 250 myhost.test.ex Hello rhu.barb [127.0.0.1]
>>> mail from:<userx@test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<userx@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> rcpt to:<ph11@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> rcpt to:<ph12@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> DATA
??? 503
<<< 503-All RCPT commands were rejected with this error:
??? 503
<<< 503-Administrative prohibition
??? 503
<<< 503 valid RCPT command must precede DATA
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> rcpt to:<userx@test.ex>
??? 503
<<< 503 sender not yet given
>>> DATA
??? 503
<<< 503-All RCPT commands were rejected with this error:
??? 503
<<< 503-503 sender not yet given
??? 503
<<< 503 valid RCPT command must precede DATA
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
