Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo foobar
??? 250
<<< 250 myhost.test.ex Hello foobar [127.0.0.1]
>>> mail from:<userx@test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<userx@test.ex>
??? 250
<<< 250 Accepted
>>> data
??? 3
<<< 354 Enter message, ending with "." on a line by itself
>>> From                                                                                                                                                                                                                              : userx
>>>   
>>> This is junk 
>>> .
??? 5
<<< 550 Administrative prohibition
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
