Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo x.y.z
??? 250
<<< 250-myhost.test.ex Hello x.y.z [127.0.0.1]
??? 250
<<< 250-SIZE 52428800
??? 250
<<< 250-8BITMIME
??? 250
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> VRFY a@b.c
??? 252
<<< 252 Administrative prohibition
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo x.y.z
??? 250
<<< 250-myhost.test.ex Hello x.y.z [127.0.0.1]
??? 250
<<< 250-SIZE 52428800
??? 250
<<< 250-8BITMIME
??? 250
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> MAIL FROM:<>
??? 250
<<< 250 OK
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script

**** SMTP testing session as if from host 10.9.8.7
**** but without any ident (RFC 1413) callback.
**** This is not for real!

220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello rhu.barb [10.9.8.7]
250 Reset OK
250 OK
214-Commands supported:
214 AUTH HELO EHLO MAIL RCPT DATA BDAT NOOP QUIT RSET HELP
250 Reset OK
250 OK
214-Commands supported:
214 AUTH HELO EHLO MAIL RCPT DATA BDAT NOOP QUIT RSET HELP
250 Reset OK
250 OK
214-Commands supported:
214 AUTH HELO EHLO MAIL RCPT DATA BDAT NOOP QUIT RSET HELP
250 Reset OK
250 OK
214-Commands supported:
214 AUTH HELO EHLO MAIL RCPT DATA BDAT NOOP QUIT RSET HELP
250 Reset OK
250 OK
214-Commands supported:
214 AUTH HELO EHLO MAIL RCPT DATA BDAT NOOP QUIT RSET HELP
250 Reset OK
250 OK
214-Commands supported:
214 AUTH HELO EHLO MAIL RCPT DATA BDAT NOOP QUIT RSET HELP
250 Reset OK
250 OK
214-Commands supported:
214 AUTH HELO EHLO MAIL RCPT DATA BDAT NOOP QUIT RSET HELP
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
550 Administrative prohibition
221 myhost.test.ex closing connection

**** SMTP testing session as if from host 10.9.8.7
**** but without any ident (RFC 1413) callback.
**** This is not for real!

220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello rhu.barb [10.9.8.7]
250 Reset OK
250 OK
214-Commands supported:
214 AUTH HELO EHLO MAIL RCPT DATA BDAT NOOP QUIT RSET HELP
250 Reset OK
250 OK
214-Commands supported:
214 AUTH HELO EHLO MAIL RCPT DATA BDAT NOOP QUIT RSET HELP
250 Reset OK
250 OK
214-Commands supported:
214 AUTH HELO EHLO MAIL RCPT DATA BDAT NOOP QUIT RSET HELP
250 Reset OK
250 OK
554 Too many nonmail commands
