Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo abcd
??? 250-
<<< 250-myhost.test.ex Hello abcd [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<userx@test.ex>\r\nrcpt to:<userx@test.ex>\r\ndata
??? 250
<<< 250 OK
??? 250
<<< 250 Accepted
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> This is a test message.
+++ 2
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
+++ 2
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> unknown
??? 500
<<< 500 unrecognized command
>>> unknown
??? 500
<<< 500 unrecognized command
>>> unknown
??? 500
<<< 500 unrecognized command
>>> unknown
??? 500
<<< 500 Too many unrecognized commands
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> vrfy
??? 501
<<< 501 empty address
>>> vrfy foo@bar
??? 252
<<< 252 Administrative prohibition
>>> vrfy
??? 501
<<< 501 empty address
>>> vrfy
??? 501
<<< 501 empty address
>>> vrfy
??? 554
<<< 554 Too many nonmail commands
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo abcd
??? 250-
<<< 250-myhost.test.ex Hello abcd [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<userx@test.ex>\r\nrcpt to:<userx@test.ex>\r\ndata
??? 250
<<< 250 OK
??? 250
<<< 250 Accepted
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> This is a test message.
>>> .
End of script
