220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaX-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaY-0005vi-00
221 myhost.test.ex closing connection

******** SERVER ********
Listening on port 1224 ... 
Connection request from [127.0.0.1]
220 ESMTP
EHLO myhost.test.ex
250-OK
250 HELP
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<x@y>
250 Receiver OK
DATA
354 Send it
Received: from CALLER by myhost.test.ex with local-smtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmaX-0005vi-00
	for x@y; Tue, 2 Mar 1999 09:44:33 +0000
From: postmaster@y
To: x@y
Subject: first test message
Message-Id: <E10HmaX-0005vi-00@myhost.test.ex>
Sender: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000

This is the FIRST message body.
.
250 OK (wizzle)
QUIT
221 bye
End of script
Listening on port 1224 ... 
Connection request from [127.0.0.1]
220 ESMTP
EHLO myhost.test.ex
250-OK
250 HELP
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<x@test.ex>
250 Receiver OK
DATA
354 Send it
Received: from CALLER by myhost.test.ex with local-smtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmaY-0005vi-00
	for x@test.ex; Tue, 2 Mar 1999 09:44:33 +0000
From: postmaster@y
To: x@y
Subject: second test message
Message-Id: <E10HmaY-0005vi-00@myhost.test.ex>
Sender: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000

.
250 OK (wizzle)
QUIT
221 bye
End of script
