Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO test
??? 250-
<<< 250-myhost.test.ex Hello test [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-LIMITS
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-PIPELINING
<<< 250-PIPELINING
??? 250 HELP
<<< 250 HELP
>>> MAIL FROM:<a@test.ex>\r\nRCPT TO:<quota_good@test.ex>
??? 250
<<< 250 OK
??? 250
<<< 250 Accepted
>>> RSET
??? 250
<<< 250 Reset OK
>>> MAIL FROM:<b@test.ex> SIZE=ssss\r\nRCPT TO:<quota_fail@test.ex>
??? 250
<<< 250 OK
??? 550
<<< 550 Administrative prohibition
>>> RSET
??? 250
<<< 250 Reset OK
>>> MAIL FROM:<c@test.ex>\r\nRCPT TO:<route_fail@test.ex>
??? 250
<<< 250 OK
??? 550
<<< 550 Administrative prohibition
>>> RSET
??? 250
<<< 250 Reset OK
>>> MAIL FROM:<d@test.ex>\r\nRCPT TO:<quota_good@test.ex>
??? 250
<<< 250 OK
??? 250
<<< 250 Accepted
>>> RSET
??? 250
<<< 250 Reset OK
>>> MAIL FROM:<e@test.ex> SIZE=ssss\r\nRCPT TO:<quota_fail@test.ex>
??? 250
<<< 250 OK
??? 550
<<< 550 Administrative prohibition
>>> RSET
??? 250
<<< 250 Reset OK
>>> MAIL FROM:<f@test.ex>\r\nRCPT TO:<route_fail@test.ex>
??? 250
<<< 250 OK
??? 550
<<< 550 Administrative prohibition
>>> QUIT
End of script
