Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> HELO me
??? 250
<<< 250 the.local.host.name Hello me [127.0.0.1]
>>> MAIL FROM:<CALLER@test.ex>
??? 250
<<< 250 OK
>>> RCPT TO:<queue_only_1@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Subject: 1
>>> .
??? 250
<<< 250 OK id=10HmaX-000000005vi-0000
>>> RSET
??? 250
<<< 250 Reset OK
>>> MAIL FROM:<CALLER@test.ex>
??? 250
<<< 250 OK
>>> RCPT TO:<queue_only_2@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Subject: 2
>>> .
??? 250
<<< 250 OK id=10HmaZ-000000005vi-0000
>>> QUIT
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> HELO me
??? 250
<<< 250 the.local.host.name Hello me [127.0.0.1]
>>> MAIL FROM:<CALLER@test.ex>
??? 250
<<< 250 OK
>>> RCPT TO:<first_pass_route_1@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Subject: 1
>>> .
??? 250
<<< 250 OK id=10HmbB-000000005vi-0000
>>> RSET
??? 250
<<< 250 Reset OK
>>> MAIL FROM:<CALLER@test.ex>
??? 250
<<< 250 OK
>>> RCPT TO:<first_pass_route_2@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Subject: 2
>>> .
??? 250
<<< 250 OK id=10HmbD-000000005vi-0000
>>> QUIT
End of script
