Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> mail from:<x@y.test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<delay4_accept@y.test.ex>
??? 250
<<< 250 Accepted
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> mail from:<x@y.test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<delay4_accept@y.test.ex>
End of script
