Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO test.ex
??? 250-
<<< 250-myhost.test.ex Hello test.ex [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250 
<<< 250 HELP
>>> MAIL FROM:<test_2@paniclogrcpt>
??? 250
<<< 250 OK
>>> RCPT TO:<dest2@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
