Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO test.ex
??? 250-
<<< 250-myhost.test.ex Hello test.ex [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250 
<<< 250 HELP
>>> MAIL FROM:<test_3@paniclogrouter>
??? 250
<<< 250 OK
>>> RCPT TO:<dest3@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> .
??? 250
<<< 250 OK id=10HmaX-000000005vi-0000
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
