Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO tester
??? 250-
<<< 250-the.local.host.name Hello tester [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-LIMITS
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-PIPELINING
<<< 250-PIPELINING
??? 250-AUTH
<<< 250-AUTH PLAIN
??? 250 HELP
<<< 250 HELP
>>> ATRN #notadvertised
??? 502
<<< 502 ATRN command used when not advertised
>>> QUIT
??? 221
<<< 221 the.local.host.name closing connection
???*
Expected EOF read
End of script
Connecting to 127.0.0.1 port PORT_D2 ... connected
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO tester
??? 250-
<<< 250-the.local.host.name Hello tester [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-LIMITS
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-ATRN
<<< 250-ATRN
??? 250-PIPELINING
<<< 250-PIPELINING
??? 250-AUTH
<<< 250-AUTH PLAIN
??? 250 HELP
<<< 250 HELP
>>> ATRN #notauth
??? 530
<<< 530 ATRN is not permitted without authentication
>>> AUTH PLAIN AHVzZXJ4AHNlY3JldA==
??? 235
<<< 235 Authentication succeeded
>>> MAIL FROM:<fred@example.com>
??? 250
<<< 250 OK
>>> ATRN #inmail
??? 503
<<< 503 ATRN is not permitted inside a transaction
>>> RSET
??? 250
<<< 250 Reset OK
>>> ATRN #failacl
??? 450
<<< 450 Administrative prohibition
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_D2 ... connected
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO tester
??? 250-
<<< 250-the.local.host.name Hello tester [ip4.ip4.ip4.ip4]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-ATRN
<<< 250-ATRN
??? 250-
<<< 250-PIPELINING
??? 250-AUTH
<<< 250-AUTH PLAIN
??? 250 HELP
<<< 250 HELP
>>> MAIL FROM:<fred@example.com>
??? 250
<<< 250 OK
>>> RCPT TO:<bill@clientdom.net>
??? 250
<<< 250 Accepted
>>> DATA
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Subject: queued msg
>>> 
>>> Body data is a single line.
>>> .
??? 250
<<< 250 OK id=10HmbE-000000005vi-0000
>>> AUTH PLAIN AHVzZXJ4AHNlY3JldA==
??? 235
<<< 235 Authentication succeeded
>>> ATRN
??? 250
<<< 250 ODMR provider turning line around
>>> 220 ODMR client now in reversed state
??? EHLO
<<< EHLO the.local.host.name
>>> 250-hello, mate
>>> 250 HELP
??? MAIL
<<< MAIL FROM:<fred@example.com>
>>> 250 saw your MAIL cmd
??? RCPT
<<< RCPT TO:<bill@clientdom.net>
>>> 250 saw your RCPT cmd
??? DATA
<<< DATA
>>> 354 go ahead
??? Received:
<<< Received: from [ip4.ip4.ip4.ip4] (helo=tester)
??? \x09by
<<< 	by the.local.host.name with esmtp (Exim x.yz)
??? \x09(
<<< 	(envelope-from <fred@example.com>)
??? \x09id
<<< 	id 10HmbE-000000005vi-0000
??? \x09for
<<< 	for bill@clientdom.net;
??? \x09
<<< 	Tue, 2 Mar 1999 09:44:33 +0000
??? Subject: queued msg
<<< Subject: queued msg
??? 
<<< 
??? Body
<<< Body data is a single line.
??? .
<<< .
>>> 250 ODMR client: message accepted
??? QUIT
<<< QUIT
>>> 221 bye
???*
Expected EOF read
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_D2 ... connected
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO tester
??? 250-
<<< 250-the.local.host.name Hello tester [ip4.ip4.ip4.ip4]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-ATRN
<<< 250-ATRN
??? 250-
<<< 250-PIPELINING
??? 250-AUTH
<<< 250-AUTH PLAIN
??? 250 HELP
<<< 250 HELP
>>> AUTH PLAIN AHVzZXJ4AHNlY3JldA==
??? 235
<<< 235 Authentication succeeded
>>> ATRN
??? 250
<<< 250 ODMR provider turning line around
>>> 220 ODMR client now in reversed state
??? EHLO
<<< EHLO the.local.host.name
>>> 250-hello, mate
>>> 250-PIPELINING
>>> 250 HELP
??? MAIL
<<< MAIL FROM:<CALLER@the.local.host.name>
>>> 250 saw your MAIL cmd
??? RCPT TO:<b
<<< RCPT TO:<b@clientdom.net>
>>> 250 saw your RCPT cmd for b
??? RCPT TO:<d
<<< RCPT TO:<d@clientdom.net>
>>> 250 saw your RCPT cmd for d
??? DATA
<<< DATA
>>> 354 go ahead
??? Received:
<<< Received: from CALLER by the.local.host.name with local (Exim x.yz)
??? \x09(
<<< 	(envelope-from <CALLER@the.local.host.name>)
??? \x09id
<<< 	id 10HmaY-000000005vi-0000;
??? \x09
<<< 	Tue, 2 Mar 1999 09:44:33 +0000
??? Subject: only b & d should be delivered
<<< Subject: only b & d should be delivered
??? Message-Id:
<<< Message-Id: <E10HmaY-000000005vi-0000@the.local.host.name>
??? From:
<<< From: CALLER_NAME <CALLER@the.local.host.name>
??? Date:
<<< Date: Tue, 2 Mar 1999 09:44:33 +0000
??? 
<<< 
??? .
<<< .
>>> 250 ODMR client: message accepted
??? MAIL
<<< MAIL FROM:<CALLER@the.local.host.name>
>>> 250 saw your MAIL cmd
??? RCPT TO:<e
<<< RCPT TO:<e@clientdom.net>
>>> 250 saw your RCPT cmd for e
??? DATA
<<< DATA
>>> 354 go ahead
??? Received:
<<< Received: from CALLER by the.local.host.name with local (Exim x.yz)
??? \x09(
<<< 	(envelope-from <CALLER@the.local.host.name>)
??? \x09id
<<< 	id 10HmaZ-000000005vi-0000
??? \x09for
<<< 	for e@clientdom.net;
??? \x09
<<< 	Tue, 2 Mar 1999 09:44:33 +0000
??? Subject: should be delivered
<<< Subject: should be delivered
??? Message-Id:
<<< Message-Id: <E10HmaZ-000000005vi-0000@the.local.host.name>
??? From:
<<< From: CALLER_NAME <CALLER@the.local.host.name>
??? Date:
<<< Date: Tue, 2 Mar 1999 09:44:33 +0000
??? 
<<< 
??? .
<<< .
>>> 250 ODMR client: message accepted
??? QUIT
<<< QUIT
>>> 221 bye
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_D2 ... connected
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO tester
??? 250-
<<< 250-the.local.host.name Hello tester [ip4.ip4.ip4.ip4]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-ATRN
<<< 250-ATRN
??? 250-
<<< 250-PIPELINING
??? 250-AUTH
<<< 250-AUTH PLAIN
??? 250 HELP
<<< 250 HELP
>>> AUTH PLAIN AHVzZXJ4AHNlY3JldA==
??? 235
<<< 235 Authentication succeeded
>>> ATRN cl2dom.net
??? 250
<<< 250 ODMR provider turning line around
>>> 220 ODMR client now in reversed state
??? EHLO
<<< EHLO the.local.host.name
>>> 250-hello, mate
>>> 250 HELP
??? MAIL
<<< MAIL FROM:<CALLER@the.local.host.name>
>>> 250 saw your MAIL cmd
??? RCPT TO:<f
<<< RCPT TO:<f@cl2dom.net>
>>> 250 saw your RCPT cmd for f
??? DATA
<<< DATA
>>> 354 go ahead
??? Received:
<<< Received: from CALLER by the.local.host.name with local (Exim x.yz)
??? \x09(
<<< 	(envelope-from <CALLER@the.local.host.name>)
??? \x09id
<<< 	id 10HmbA-000000005vi-0000
??? \x09for
<<< 	for f@cl2dom.net;
??? \x09
<<< 	Tue, 2 Mar 1999 09:44:33 +0000
??? Subject: should be delivered
<<< Subject: should be delivered
??? Message-Id:
<<< Message-Id: <E10HmbA-000000005vi-0000@the.local.host.name>
??? From:
<<< From: CALLER_NAME <CALLER@the.local.host.name>
??? Date:
<<< Date: Tue, 2 Mar 1999 09:44:33 +0000
??? 
<<< 
??? .
<<< .
>>> 250 ODMR client: message accepted
??? QUIT
<<< QUIT
>>> 221 bye
End of script
TTT   sss 10HmaX-000000005vi-0000 <CALLER@the.local.host.name>
          a@otherdomain.net

Connecting to ip4.ip4.ip4.ip4 port PORT_D2 ... connected
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO tester
??? 250-
<<< 250-the.local.host.name Hello tester [ip4.ip4.ip4.ip4]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-ATRN
<<< 250-ATRN
??? 250-
<<< 250-PIPELINING
??? 250-AUTH
<<< 250-AUTH PLAIN
??? 250 HELP
<<< 250 HELP
>>> AUTH PLAIN AHVzZXJ4AHNlY3JldA==
??? 235
<<< 235 Authentication succeeded
>>> ATRN cl2dom.net
??? 453
<<< 453 You have no mail
>>> QUIT
??? 221
<<< 221 the.local.host.name closing connection
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_D2 ... connected
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO tester
??? 250-
<<< 250-the.local.host.name Hello tester [ip4.ip4.ip4.ip4]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-ATRN
<<< 250-ATRN
??? 250-
<<< 250-PIPELINING
??? 250-AUTH
<<< 250-AUTH PLAIN
??? 250 HELP
<<< 250 HELP
>>> AUTH PLAIN AHVzZXJ4AHNlY3JldA==
??? 235
<<< 235 Authentication succeeded
>>> ATRN
??? 250
<<< 250 ODMR provider turning line around
>>> 220 ODMR client now in reversed state
??? EHLO
<<< EHLO the.local.host.name
>>> 250-hello, mate
>>> 250 HELP
??? MAIL
<<< MAIL FROM:<CALLER@the.local.host.name>
>>> 250 saw your MAIL cmd
??? RCPT TO:<g
<<< RCPT TO:<g@clientdom.net>
>>> 250 saw your RCPT cmd for g
??? DATA
<<< DATA
>>> 354 go ahead
??? Received:
<<< Received: from CALLER by the.local.host.name with local (Exim x.yz)
??? \x09(
<<< 	(envelope-from <CALLER@the.local.host.name>)
??? \x09id
<<< 	id 10HmbB-000000005vi-0000
??? \x09for
<<< 	for g@clientdom.net;
??? \x09
<<< 	Tue, 2 Mar 1999 09:44:33 +0000
??? Subject: should be delivered
<<< Subject: should be delivered
??? Message-Id:
<<< Message-Id: <E10HmbB-000000005vi-0000@the.local.host.name>
??? From:
<<< From: CALLER_NAME <CALLER@the.local.host.name>
??? Date:
<<< Date: Tue, 2 Mar 1999 09:44:33 +0000
??? 
<<< 
??? .
<<< .
>>> 250 ODMR client: message accepted
??? QUIT
<<< QUIT
>>> 221 bye
End of script
