Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 testhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo tester
??? 250-
<<< 250-testhost.test.ex Hello tester [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-CHUNKING
<<< 250-CHUNKING
??? 250 HELP
<<< 250 HELP
>>> mail from:someone1@some.domain
??? 250
<<< 250 OK
>>> rcpt to:CALLER@test.ex
??? 250
<<< 250 Accepted
>>> bdat 88 last
>>> To: Susan@random.com
>>> From: Sam@random.com
>>> Subject: This is a bodyless test message
>>> 
??? 250-
<<< 250- 88 byte chunk, total 88
??? 250
<<< 250 OK id=10HmaX-000000005vi-0000
>>> quit
??? 221
<<< 221 testhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 testhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo tester
??? 250-
<<< 250-testhost.test.ex Hello tester [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-CHUNKING
??? 250 
<<< 250 HELP
>>> mail from:someone2@some.domain
??? 250
<<< 250 OK
>>> rcpt to:CALLER@test.ex
??? 250
<<< 250 Accepted
>>> bdat 100
>>> To: Susan@random.com
>>> From: Sam@random.com
>>> Subject: This is a bodyfull test message
>>> 
>>> 1234567890
??? 250
<<< 250 100 byte chunk received
>>> noop
??? 250
<<< 250 OK
>>> bdat 0 last
??? 250-
<<< 250- 0 byte chunk, total 100
??? 250
<<< 250 OK id=10HmaY-000000005vi-0000
>>> mail from:someone3@some.domain
??? 250
<<< 250 OK
>>> rcpt to:CALLER@test.ex
??? 250
<<< 250 Accepted
>>> bdat 10
>>> To: Susan@
??? 250
<<< 250 10 byte chunk received
>>> bdat 78 last
>>> random.com
>>> From: Sam@random.com
>>> Subject: This is a bodyless test message
>>> 
??? 250-
<<< 250- 78 byte chunk, total 88
??? 250
<<< 250 OK id=10HmaZ-000000005vi-0000
>>> quit
??? 221
<<< 221 testhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 testhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo tester
??? 250-
<<< 250-testhost.test.ex Hello tester [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-CHUNKING
??? 250 
<<< 250 HELP
>>> mail from:someone2A@some.domain
??? 250
<<< 250 OK
>>> rcpt to:CALLER@test.ex
??? 250
<<< 250 Accepted
>>> bdat 100
>>> To: Susan@random.com
>>> From: Sam@random.com
>>> Subject: This is a bodyfull test message
>>> 
>>> 1234567890
??? 250
<<< 250 100 byte chunk received
>>> noop
??? 250
<<< 250 OK
>>> bdat 0 last
??? 250-
<<< 250- 0 byte chunk, total 100
??? 250
<<< 250 OK id=10HmbA-000000005vi-0000
>>> mail from:someone3A@some.domain
??? 250
<<< 250 OK
>>> rcpt to:CALLER@test.ex
??? 250
<<< 250 Accepted
>>> bdat 10
>>> To: Susan@
??? 250
<<< 250 10 byte chunk received
>>> bdat 78 last
>>> random.com
>>> From: Sam@random.com
>>> Subject: This is a bodyless test message
>>> 
??? 250-
<<< 250- 78 byte chunk, total 88
??? 250
<<< 250 OK id=10HmbB-000000005vi-0000
>>> quit
??? 221
<<< 221 testhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 testhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo tester
??? 250-
<<< 250-testhost.test.ex Hello tester [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-CHUNKING
??? 250 
<<< 250 HELP
>>> mail from:someone4@some.domain
??? 250
<<< 250 OK
>>> rcpt to:CALLER@test.ex
??? 250
<<< 250 Accepted
>>> bdat 89 last
>>> To: Susan@random.com
>>> From: Sam@random.com
>>> Subject: This is a bodyless test message
>>> 
??? 421
<<< 421 testhost.test.ex SMTP incoming data timeout - closing connection.
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 testhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo tester
??? 250-
<<< 250-testhost.test.ex Hello tester [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-CHUNKING
??? 250 
<<< 250 HELP
>>> mail from:someone5@some.domain
??? 250
<<< 250 OK
>>> rcpt to:CALLER@test.ex
??? 250
<<< 250 Accepted
>>> bdat 88
>>> To: Susan@random.com
>>> From: Sam@random.com
>>> Subject: This is a bodyless test message
>>> 
??? 250
<<< 250 88 byte chunk received
>>> bdat 0
??? 504
<<< 504 zero size for BDAT command
>>> quit
??? 221
<<< 221 testhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 testhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo tester
??? 250-
<<< 250-testhost.test.ex Hello tester [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-CHUNKING
??? 250 
<<< 250 HELP
>>> mail from:someone6@some.domain
??? 250
<<< 250 OK
>>> rcpt to:CALLER@test.ex
??? 250
<<< 250 Accepted
>>> bdat 88
>>> To: Susan@random.com
>>> From: Sam@random.com
>>> Subject: This is a bodyless test message
>>> 
??? 250
<<< 250 88 byte chunk received
>>> data
??? 503
<<< 503 only BDAT permissible after non-LAST BDAT
>>> RSET
??? 250
<<< 250 Reset OK
>>> EHLO tester
??? 250-
<<< 250-testhost.test.ex Hello tester [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-CHUNKING
??? 250 
<<< 250 HELP
>>> mail from:someone7@some.domain
??? 250
<<< 250 OK
>>> rcpt to:CALLER@test.ex
??? 250
<<< 250 Accepted
>>> bdat 88
>>> To: Susan@random.com
>>> From: Sam@random.com
>>> Subject: This is a bodyless test message
>>> 
??? 250
<<< 250 88 byte chunk received
>>> data
??? 503
<<< 503 only BDAT permissible after non-LAST BDAT
>>> data
??? 503
<<< 503 only RSET accepted now
>>> quit
??? 221
<<< 221 testhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 testhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo tester
??? 250-
<<< 250-testhost.test.ex Hello tester [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-CHUNKING
<<< 250-CHUNKING
??? 250 HELP
<<< 250 HELP
>>> mail from:someone8@some.domain
??? 250
<<< 250 OK
>>> rcpt to:CALLER@test.ex
??? 250
<<< 250 Accepted
>>> bdat 88 last\r\nTo: Susan@random.com
>>> From: Sam@random.com
>>> Subject: This is a bodyless test message
>>> 
??? 250-
<<< 250- 88 byte chunk, total 88
??? 250
<<< 250 OK id=10HmbF-000000005vi-0000
>>> quit
??? 221
<<< 221 testhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 testhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo tester
??? 250-
<<< 250-testhost.test.ex Hello tester [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-CHUNKING
<<< 250-CHUNKING
??? 250 HELP
<<< 250 HELP
>>> MAIL FROM:someone9@some.domain
??? 250
<<< 250 OK
>>> RCPT TO:CALLER@test.ex
??? 250
<<< 250 Accepted
>>> BDAT 1\r\nTBDAT 87 last\r\no: Susan@random.com\r\nFrom: Sam@random.com\r\nSubject: This is a bodyless test message\r\n\r\n
??? 554 SMTP synchronization error
<<< 554 SMTP synchronization error
End of script
