Connecting to 127.0.0.1 port PORT_D ... connected
Attempting to start TLS
Succeeded in starting TLS
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<userx1_3@test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<userx@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 3
<<< 354 Enter message, ending with "." on a line by itself
>>> This is a test encrypted message.
>>> .
??? 250
<<< 250 OK id=10HmaX-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Message 10HmaX-000000005vi-0000 has been removed
Connecting to 127.0.0.1 port PORT_D ... connected
Attempting to start TLS
Succeeded in starting TLS
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<userx1_2@test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<userx@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 3
<<< 354 Enter message, ending with "." on a line by itself
>>> This is a test encrypted message.
>>> .
??? 250
<<< 250 OK id=10HmaY-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Message 10HmaY-000000005vi-0000 has been removed
Connecting to ip4.ip4.ip4.ip4 port PORT_D ... connected
Certificate file = TESTSUITE/aux-fixed/exim-ca/example.org/server2.example.org/server2.example.org.pem
Key file = TESTSUITE/aux-fixed/exim-ca/example.org/server2.example.org/server2.example.org.unlocked.key
Attempting to start TLS
Succeeded in starting TLS
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [ip4.ip4.ip4.ip4]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<userx_clientcert@test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<userx@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 3
<<< 354 Enter message, ending with "." on a line by itself
>>> This is a test encrypted message.
>>> .
??? 250
<<< 250 OK id=10HmaZ-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Message 10HmaZ-000000005vi-0000 has been removed
