Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250-
<<< 250-STARTTLS
??? 250
<<< 250 HELP
>>> starttls
??? 220
<<< 220 TLS go ahead
Attempting to start TLS
Succeeded in starting TLS
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<CALLER@test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<CALLER@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 3
<<< 354 Enter message, ending with "." on a line by itself
>>> This is a test encrypted message.
>>> .
??? 250
<<< 250 OK id=10HmaX-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250-
<<< 250-STARTTLS
??? 250
<<< 250 HELP
>>> starttls
??? 220
<<< 220 TLS go ahead
Attempting to start TLS
Succeeded in starting TLS
>>> helo test
??? 250
<<< 250 myhost.test.ex Hello test [127.0.0.1]
>>> mail from:<"name with spaces"@test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<CALLER@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 3
<<< 354 Enter message, ending with "." on a line by itself
>>> This is a test encrypted message.
>>> .
??? 250
<<< 250 OK id=10HmaY-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [ip4.ip4.ip4.ip4]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-LIMITS
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-PIPELINING
<<< 250-PIPELINING
??? 250-STARTTLS
<<< 250-STARTTLS
??? 250 HELP
<<< 250 HELP
>>> starttls
??? 220 TLS go ahead
<<< 220 TLS go ahead
Attempting to start TLS
gnutls_handshake: A TLS fatal alert has been received.
Failed to start TLS
>>> nop
???*
Expected EOF read
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_D ... connected
Certificate file = TESTSUITE/aux-fixed/exim-ca/example.com/server2.example.com/server2.example.com.pem
Key file = TESTSUITE/aux-fixed/exim-ca/example.com/server2.example.com/server2.example.com.unlocked.key
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [ip4.ip4.ip4.ip4]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250-
<<< 250-STARTTLS
??? 250
<<< 250 HELP
>>> starttls
??? 220
<<< 220 TLS go ahead
Attempting to start TLS
Succeeded in starting TLS
>>> helo test
??? 250
<<< 250 myhost.test.ex Hello test [ip4.ip4.ip4.ip4]
>>> mail from:<CALLER@test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<CALLER@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 3
<<< 354 Enter message, ending with "." on a line by itself
>>> This is a test encrypted message from a verified host.
>>> .
??? 250
<<< 250 OK id=10HmaZ-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250-
<<< 250-STARTTLS
??? 250
<<< 250 HELP
>>> starttls
??? 220
<<< 220 TLS go ahead
Attempting to start TLS
Succeeded in starting TLS
>>> helo test
??? 250
<<< 250 myhost.test.ex Hello test [127.0.0.1]
>>> mail from:<CALLER@test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<CALLER@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 3
<<< 354 Enter message, ending with "." on a line by itself
>>> This is a test encrypted message.
>>> It should be sent under the RSA server cert and with an RSA cipher.
>>> .
??? 250
<<< 250 OK id=10HmbA-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250-
<<< 250-STARTTLS
??? 250
<<< 250 HELP
>>> starttls
??? 220
<<< 220 TLS go ahead
Attempting to start TLS
Succeeded in starting TLS
>>> helo test
??? 250
<<< 250 myhost.test.ex Hello test [127.0.0.1]
>>> mail from:<CALLER@test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<CALLER@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 3
<<< 354 Enter message, ending with "." on a line by itself
>>> This is a test encrypted message.
>>> It should be sent under the EC server cert and with an ECDSA cipher.
>>> .
??? 250
<<< 250 OK id=10HmbB-000000005vi-0000
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script

**** SMTP testing session as if from host 10.0.0.1
**** This is not for real!

220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
503 STARTTLS command used when not advertised
221 myhost.test.ex closing connection
