Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250-
<<< 250-STARTTLS
??? 250
<<< 250 HELP
>>> starttls
??? 220
<<< 220 TLS go ahead
Attempting to start TLS
SSL connection using AES256-SHA
Succeeded in starting TLS
>>> mail from:<userx@test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<userx@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 3
<<< 354 Enter message, ending with "." on a line by itself
>>> This is a test encrypted message.
>>> .
??? 250
<<< 250 OK id=10HmaX-0005vi-00
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250-
<<< 250-STARTTLS
??? 250
<<< 250 HELP
>>> mail from:<userx@test.ex>
??? 250
<<< 250 OK
>>> rcpt to:<userx@test.ex>
??? 550
<<< 550 "You must encrypt"
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
