Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo foobar
??? 250-
<<< 250-myhost.test.ex Hello foobar [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250-
<<< 250-AUTH PLAIN
??? 250-
<<< 250-STARTTLS
??? 250
<<< 250 HELP
>>> starttls
??? 220
<<< 220 TLS go ahead
Attempting to start TLS
Succeeded in starting TLS
>>> auth plain AHVzZXJ4AHNlY3JldA==
??? 503
<<< 503 AUTH command used when not advertised
>>> mail from:<x@y> size=1234
??? 501
<<< 501 <x@y> size=1234: malformed address: size=1234 may not follow <x@y> 
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo foobar
??? 250-
<<< 250-myhost.test.ex Hello foobar [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250-
<<< 250-AUTH PLAIN
??? 250-
<<< 250-STARTTLS
??? 250
<<< 250 HELP
>>> starttls
??? 220
<<< 220 TLS go ahead
Attempting to start TLS
Succeeded in starting TLS
>>> auth plain AHVzZXJ4AHNlY3JldA==
??? 235
<<< 235 Authentication succeeded
>>> mail from:<x@y> size=1234
??? 250
<<< 250 OK
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
