### non-prox plain receive
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> HELO clientname
??? 250
<<< 250 myhost.test.ex Hello clientname [IP_LOOPBACK_ADDR]
>>> MAIL FROM:<a@test.ex>
??? 250
<<< 250 OK
>>> RCPT TO:<b@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Subject: test
>>> 
>>> body
>>> .
??? 250
<<< 250 OK id=10HmaX-000000005vi-0000
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
### protocol v1 plain receive
Connecting to ip4.ip4.ip4.ip4 port PORT_D ... connected
>>> PROXY TCP4 127.0.0.2 127.42.42.42 64000 25
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> HELO clientname
??? 250
<<< 250 myhost.test.ex Hello clientname [127.0.0.2]
>>> MAIL FROM:<c@test.ex>
??? 250
<<< 250 OK
>>> RCPT TO:<d@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Subject: test
>>> 
>>> body
>>> .
??? 250
<<< 250 OK id=10HmaY-000000005vi-0000
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
### protocol v2 plain receive
Connecting to ip4.ip4.ip4.ip4 port PORT_D ... connected
>>> \x0D\x0A\x0D\x0A\x00\x0D\x0A\x51\x55\x49\x54\x0A\x21\x11\x00\x0c\x7f\x00\x00\x02\x7f\x2a\x2a\x2a\xc2\x95\x04\x01
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> HELO clientname
??? 250
<<< 250 myhost.test.ex Hello clientname [127.0.0.2]
>>> MAIL FROM:<e@test.ex>
??? 250
<<< 250 OK
>>> RCPT TO:<f@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Subject: test
>>> 
>>> body
>>> .
??? 250
<<< 250 OK id=10HmaZ-000000005vi-0000
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
### proxy timeout
Connecting to ip4.ip4.ip4.ip4 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> PROXY TCP4 127.0.0.2 127.42.42.42 64000 25
??? 503
<<< 503 Command refused, required Proxy negotiation failed
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script

******** SERVER ********
### non-prox plain receive
### protocol v1 plain receive
### protocol v2 plain receive
### proxy timeout
