Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO testclient
??? 250-
<<< 250-the.local.host.name Hello testclient [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-PIPELINING
<<< 250-PIPELINING
??? 250 HELP
<<< 250 HELP
>>> QUIT
??? 221
<<< 221 the.local.host.name closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO testclient
??? 250-
<<< 250-the.local.host.name Hello testclient [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-PIPELINING
<<< 250-PIPELINING
??? 250-PIPE_CONNECT
<<< 250-PIPE_CONNECT
??? 250 HELP
<<< 250 HELP
>>> QUIT
??? 221
<<< 221 the.local.host.name closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
>>> EHLO testclient
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
??? 250-
<<< 250-the.local.host.name Hello testclient [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-PIPELINING
<<< 250-PIPELINING
??? 250-PIPE_CONNECT
<<< 250-PIPE_CONNECT
??? 250 HELP
<<< 250 HELP
>>> QUIT
??? 221
<<< 221 the.local.host.name closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
>>> EHLO testclient\r\nMAIL FROM:<a@test.ex>
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
??? 250-
<<< 250-the.local.host.name Hello testclient [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-PIPELINING
<<< 250-PIPELINING
??? 250-PIPE_CONNECT
<<< 250-PIPE_CONNECT
??? 250 HELP
<<< 250 HELP
??? 250
<<< 250 OK
>>> QUIT
??? 221
<<< 221 the.local.host.name closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
>>> EHLO testclient\r\nMAIL FROM:<a@test.ex>\r\nRCPT TO:<a@test.ex>
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
??? 250-
<<< 250-the.local.host.name Hello testclient [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-PIPELINING
<<< 250-PIPELINING
??? 250-PIPE_CONNECT
<<< 250-PIPE_CONNECT
??? 250 HELP
<<< 250 HELP
??? 250
<<< 250 OK
??? 250
<<< 250 Accepted
>>> QUIT
??? 221
<<< 221 the.local.host.name closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
>>> EHLO testclient\r\nMAIL FROM:<a@test.ex>\r\nRCPT TO:<a@test.ex>\r\nDATA
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
??? 250-
<<< 250-the.local.host.name Hello testclient [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-PIPELINING
<<< 250-PIPELINING
??? 250-PIPE_CONNECT
<<< 250-PIPE_CONNECT
??? 250 HELP
<<< 250 HELP
??? 250
<<< 250 OK
??? 250
<<< 250 Accepted
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> .
??? 250
<<< 250 OK id=10HmaX-0005vi-00
>>> QUIT
??? 221
<<< 221 the.local.host.name closing connection
End of script
