220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello CALLER at host.name [1.2.3.4]
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaY-000000005vi-0000
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaZ-000000005vi-0000
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 myhost.test.ex Hello CALLER at host2.name [4.3.2.1]
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaX-000000005vi-0000
221 myhost.test.ex closing connection
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> HELO test
??? 250
<<< 250 myhost.test.ex Hello localhost [127.0.0.1]
>>> MAIL FROM:<>
??? 250
<<< 250 OK
>>> RCPT TO:<x@y>
??? 250
<<< 250 Accepted
>>> DATA
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> .
??? 250
<<< 250 OK id=10HmbA-000000005vi-0000
>>> QUIT
End of script
