Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO client
??? 250-
<<< 250-the.local.host.name Hello client [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-PIPELINING
<<< 250-PIPELINING
??? 250-SMTPUTF8
<<< 250-SMTPUTF8
??? 250 HELP
<<< 250 HELP
>>> MAIL FROM: <someone@some.domain> SMTPUTF8
??? 250
<<< 250 OK
>>> RCPT TO: <userx@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Subject: test
>>> 
>>> body
>>> .
??? 250
<<< 250 OK id=10HmaZ-0005vi-00
>>> QUIT
??? 221
<<< 221 the.local.host.name closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO client
??? 250-
<<< 250-the.local.host.name Hello client [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-PIPELINING
<<< 250-PIPELINING
??? 250-SMTPUTF8
<<< 250-SMTPUTF8
??? 250 HELP
<<< 250 HELP
>>> MAIL FROM: <ليهمابتكلموشعربي؟@czech.Pročprostěnemluvíčesky.com> SMTPUTF8
??? 250
<<< 250 OK
>>> RCPT TO: <userx@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Subject: test
>>> 
>>> body
>>> .
??? 250
<<< 250 OK id=10HmbA-0005vi-00
>>> QUIT
??? 221
<<< 221 the.local.host.name closing connection
End of script
220 the.local.host.name ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-the.local.host.name Hello CALLER at client.bh
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250-SMTPUTF8
250 HELP
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaX-0005vi-00
221 the.local.host.name closing connection
