### sha256, 1024b + message in 1 chunk
Connecting to 127.0.0.1 port 1224 ... connected
??? 220
<<< 220 testhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO xxx
??? 250-
<<< 250-testhost.test.ex Hello xxx [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250-
<<< 250-CHUNKING
??? 250
<<< 250 HELP
>>> MAIL FROM:<CALLER@bloggs.com>
??? 250
<<< 250 OK
>>> RCPT TO:<a@test.ex>
??? 250
<<< 250 Accepted
>>> BDAT 557 LAST
>>> DKIM-Signature: v=1; a=rsa-sha256; c=simple/simple; d=test.ex; h=from:to
>>> 	:date:message-id:subject; s=sel; bh=ZS4D3qDAC7osugrdWUTQc9HUuaSC
>>> 	+ScH3/NkwGGOlT0=; b=ncPDYKtCsFuFA7wXHxagsZUh3Rpu0dK6Dl7FbkGykEwU
>>> 	L/MoAe0D+Aynz+yO0k3d4vGZ6Q2sEJ4MaOZI27ezOSBsBnEhw+0uOaxE6HZew5VD
>>> 	owfSxfXTkyfJd0CHdtYoXT0OqngTBOtAv87u1T4aLRDY1yAqasVuvLV7V80d4tQ=
>>> From: mrgus@text.ex
>>> To: bakawolf@yahoo.com
>>> Date: Tue, 2 Mar 1999 09:44:33 +0000
>>> Message-ID: <qwerty1234@disco-zombie.net>
>>> Subject: simple test
>>> 
>>> Line 1: This is a simple test.
>>> Line 2: This is a simple test.
??? 250- 557
<<< 250- 557 byte chunk, total 557
??? 250
<<< 250 OK id=10HmaX-0005vi-00
>>> QUIT
??? 221
<<< 221 testhost.test.ex closing connection
End of script
### sha256, 1024b + message in 2 chunks
Connecting to 127.0.0.1 port 1224 ... connected
??? 220
<<< 220 testhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO xxx
??? 250-
<<< 250-testhost.test.ex Hello xxx [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250-
<<< 250-CHUNKING
??? 250
<<< 250 HELP
>>> MAIL FROM:<CALLER@bloggs.com>
??? 250
<<< 250 OK
>>> RCPT TO:<a@test.ex>
??? 250
<<< 250 Accepted
>>> BDAT 525
>>> DKIM-Signature: v=1; a=rsa-sha256; c=simple/simple; d=test.ex; h=from:to
>>> 	:date:message-id:subject; s=sel; bh=ZS4D3qDAC7osugrdWUTQc9HUuaSC
>>> 	+ScH3/NkwGGOlT0=; b=ncPDYKtCsFuFA7wXHxagsZUh3Rpu0dK6Dl7FbkGykEwU
>>> 	L/MoAe0D+Aynz+yO0k3d4vGZ6Q2sEJ4MaOZI27ezOSBsBnEhw+0uOaxE6HZew5VD
>>> 	owfSxfXTkyfJd0CHdtYoXT0OqngTBOtAv87u1T4aLRDY1yAqasVuvLV7V80d4tQ=
>>> From: mrgus@text.ex
>>> To: bakawolf@yahoo.com
>>> Date: Tue, 2 Mar 1999 09:44:33 +0000
>>> Message-ID: <qwerty1234@disco-zombie.net>
>>> Subject: simple test
>>> 
>>> Line 1: This is a simple test.
??? 250 525
<<< 250 525 byte chunk received
>>> BDAT 32 LAST
>>> Line 2: This is a simple test.
??? 250- 32
<<< 250- 32 byte chunk, total 557
??? 250
<<< 250 OK id=10HmaY-0005vi-00
>>> QUIT
??? 221
<<< 221 testhost.test.ex closing connection
End of script

******** SERVER ********
### sha256, 1024b + message in 1 chunk
### sha256, 1024b + message in 2 chunks
