Connecting to 127.0.0.1 port 1224 ... connected
??? 220
<<< 220 testhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO xxx
??? 250-
<<< 250-testhost.test.ex Hello xxx [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250-
<<< 250-CHUNKING
??? 250
<<< 250 HELP
>>> MAIL FROM:<CALLER@bloggs.com>
??? 250
<<< 250 OK
>>> RCPT TO:<z@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Subject: simple test
>>> 
>>> Line 1: This is a simple test.
>>> Line 2: This is a simple test.
>>> ..Line 3 has a leading dot
>>> last line: 4
>>> .
??? 250
<<< 250 OK id=10HmaZ-0005vi-00
>>> QUIT
??? 221
<<< 221 testhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port 1224 ... connected
??? 220
<<< 220 testhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO xxx
??? 250-
<<< 250-testhost.test.ex Hello xxx [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250-
<<< 250-CHUNKING
??? 250
<<< 250 HELP
>>> MAIL FROM:<CALLER@bloggs.com>
??? 250
<<< 250 OK
>>> RCPT TO:<y@test.ex>
??? 250
<<< 250 Accepted
>>> BDAT 129 LAST
>>> Subject: simple test
>>> 
>>> Line 1: This is a simple test.
>>> Line 2: This is a simple test.
>>> .Line 3 has a leading dot
>>> last line: 4
??? 250-
<<< 250- 129 byte chunk, total 129
??? 250
<<< 250 OK id=10HmbA-0005vi-00
>>> QUIT
??? 221
<<< 221 testhost.test.ex closing connection
End of script
