Connecting to ip4.ip4.ip4.ip4 port PORT_S ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo cname.test.ex
??? 250
<<< 250 myhost.test.ex Hello cname.test.ex [ip4.ip4.ip4.ip4]
>>> mail from:<a@test.again.dns>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 451
<<< 451 Temporary local problem - please try later
>>> quit
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_S ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo cname.test.ex
??? 250
<<< 250 myhost.test.ex Hello cname.test.ex [ip4.ip4.ip4.ip4]
>>> mail from:<b@test.example.com>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 250
<<< 250 Accepted
>>> quit
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_S ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo cname.test.ex
??? 250
<<< 250 myhost.test.ex Hello cname.test.ex [ip4.ip4.ip4.ip4]
>>> mail from:<failme@example.com>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> quit
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_S ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo cname.test.ex
??? 250
<<< 250 myhost.test.ex Hello cname.test.ex [ip4.ip4.ip4.ip4]
>>> mail from:<a@passme.example.com>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 250
<<< 250 Accepted
>>> quit
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_S ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo cname.test.ex
??? 250
<<< 250 myhost.test.ex Hello cname.test.ex [ip4.ip4.ip4.ip4]
>>> mail from:<a@neutral.example.com>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 250
<<< 250 Accepted
>>> quit
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_S ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo cname.test.ex
??? 250
<<< 250 myhost.test.ex Hello cname.test.ex [ip4.ip4.ip4.ip4]
>>> mail from:<a@softfail.example.com>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 250
<<< 250 Accepted
>>> quit
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_S ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo passme.helo.example.com
??? 250
<<< 250 myhost.test.ex Hello passme.helo.example.com [ip4.ip4.ip4.ip4]
>>> mail from:<>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 250
<<< 250 Accepted
>>> quit
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_S ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo passme.helo.example.com
??? 250
<<< 250 myhost.test.ex Hello passme.helo.example.com [ip4.ip4.ip4.ip4]
>>> mail from:<failme@example.com>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> quit
End of script
