Connecting to 127.0.0.1 port PORT_S ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo testclient
??? 250
<<< 250 myhost.test.ex Hello testclient [127.0.0.1]
>>> mail from:<a@example.com>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 250
<<< 250 Accepted
>>> quit
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_S ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo testclient
??? 250
<<< 250 myhost.test.ex Hello testclient [ip4.ip4.ip4.ip4]
>>> mail from:<b@test.example.com>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 250
<<< 250 Accepted
>>> quit
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo testclient
??? 250
<<< 250 myhost.test.ex Hello testclient [127.0.0.1]
>>> mail from:<c@example.com>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 250
<<< 250 Accepted
>>> quit
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo testclient
??? 250
<<< 250 myhost.test.ex Hello testclient [ip4.ip4.ip4.ip4]
>>> mail from:<b@test.example.com>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> quit
End of script
Connecting to 127.0.0.1 port PORT_D2 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo testclient
??? 250
<<< 250 myhost.test.ex Hello testclient [127.0.0.1]
>>> mail from:<c@example.com>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> quit
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_S ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo passme.helo.example.com
??? 250
<<< 250 myhost.test.ex Hello passme.helo.example.com [ip4.ip4.ip4.ip4]
>>> mail from:<>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 250
<<< 250 Accepted
>>> quit
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_S ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo passme.helo.example.com
??? 250
<<< 250 myhost.test.ex Hello passme.helo.example.com [ip4.ip4.ip4.ip4]
>>> mail from:<failme@example.com>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 550
<<< 550 Administrative prohibition
>>> quit
End of script
