Connecting to ip4.ip4.ip4.ip4 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo testclient
??? 250
<<< 250 myhost.test.ex Hello testclient [ip4.ip4.ip4.ip4]
>>> mail from:<a@example.com>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 250
<<< 250 Accepted
>>> quit
End of script
Connecting to ip4.ip4.ip4.ip4 port PORT_S ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> helo testclient
??? 250
<<< 250 myhost.test.ex Hello testclient [ip4.ip4.ip4.ip4]
>>> mail from:<b@example.com>
??? 250
<<< 250 OK
>>> rcpt to:<fred@test.ex>
??? 250
<<< 250 Accepted
>>> quit
End of script
> eDNS_NOMATCH       none      none
> eDNS_NODATA        none      none
> eDNS_AGAIN         temperror temperror
> multiple rr        permerror permerror
> multi + non-spf    permerror permerror
> uppercase in v=    pass      pass
> only non-spf txt   none      none
> 
