Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO tester
??? 250-
<<< 250-myhost.test.ex Hello tester [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-LIMITS MAILMAX=1000
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=50000
??? 250
<<< 250-8BITMIME
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO tester
??? 250-
<<< 250-myhost.test.ex Hello tester [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-8BITMIME
<<< 250-8BITMIME
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO tester
??? 250-
<<< 250-myhost.test.ex Hello tester [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-LIMITS MAILMAX=42
<<< 250-LIMITS MAILMAX=42 RCPTMAX=50000
??? 250
<<< 250-8BITMIME
End of script
Connecting to ip4.ip4.ip4.ip4 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO tester
??? 250-
<<< 250-myhost.test.ex Hello tester [ip4.ip4.ip4.ip4]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-LIMITS MAILMAX=44
<<< 250-LIMITS MAILMAX=44 RCPTMAX=50000
??? 250
<<< 250-8BITMIME
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO tester
??? 250-
<<< 250-myhost.test.ex Hello tester [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250
<<< 250-LIMITS RCPTMAX=50000
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO tester
??? 250-
<<< 250-myhost.test.ex Hello tester [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-LIMITS MAILMAX=1000 RCPTMAX=5
<<< 250-LIMITS MAILMAX=1000 RCPTMAX=5
??? 250
<<< 250-8BITMIME
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO tester
??? 250-
<<< 250-myhost.test.ex Hello tester [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-LIMITS RCPTMAX=5
<<< 250-LIMITS RCPTMAX=5
??? 250
<<< 250-8BITMIME
End of script
