
******** SERVER ********
Listening on port PORT_D ... 
Connection request from [127.0.0.1]
220 Hi there
EHLO the.local.host.name
250-yeah mate
250 LIMITS MAILMAX=10
MAIL FROM:<CALLER@the.local.host.name>
250 mail cmd good
RCPT TO:<a@test.ex>
250 rcpt cmd 1 good
RCPT TO:<b@test.ex>
250 rcpt cmd 2 good
RCPT TO:<c@test.ex>
250 rcpt cmd 3 good
RCPT TO:<d@test.ex>
250 rcpt cmd 4 good
RCPT TO:<e@test.ex>
250 rcpt cmd 5 good
DATA
352 go ahead
Received: from CALLER by the.local.host.name with local (Exim x.yz)
	(envelope-from <CALLER@the.local.host.name>)
	id 10HmaX-000000005vi-0000;
	Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaX-000000005vi-0000@the.local.host.name>
From: CALLER_NAME <CALLER@the.local.host.name>
Date: Tue, 2 Mar 1999 09:44:33 +0000

.
250 message received
QUIT
220 bye
End of script
Listening on port PORT_D ... 
Connection request from [127.0.0.1]
220 Hi there
EHLO the.local.host.name
250-yeah mate
250 LIMITS RCPTMAX=2
MAIL FROM:<CALLER@the.local.host.name>
250 mail cmd good
RCPT TO:<a@test.ex>
250 rcpt cmd 1 good
RCPT TO:<b@test.ex>
250 rcpt cmd 2 good
DATA
352 go ahead
Received: from CALLER by the.local.host.name with local (Exim x.yz)
	(envelope-from <CALLER@the.local.host.name>)
	id 10HmaY-000000005vi-0000;
	Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaY-000000005vi-0000@the.local.host.name>
From: CALLER_NAME <CALLER@the.local.host.name>
Date: Tue, 2 Mar 1999 09:44:33 +0000

.
250 message received
MAIL FROM:<CALLER@the.local.host.name>
250 mail cmd good
RCPT TO:<c@test.ex>
250 rcpt cmd 3 good
RCPT TO:<d@test.ex>
250 rcpt cmd 4 good
DATA
352 go ahead
Received: from CALLER by the.local.host.name with local (Exim x.yz)
	(envelope-from <CALLER@the.local.host.name>)
	id 10HmaY-000000005vi-0000;
	Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaY-000000005vi-0000@the.local.host.name>
From: CALLER_NAME <CALLER@the.local.host.name>
Date: Tue, 2 Mar 1999 09:44:33 +0000

.
250 message received
MAIL FROM:<CALLER@the.local.host.name>
250 mail cmd good
RCPT TO:<e@test.ex>
250 rcpt cmd 5 good
DATA
352 go ahead
Received: from CALLER by the.local.host.name with local (Exim x.yz)
	(envelope-from <CALLER@the.local.host.name>)
	id 10HmaY-000000005vi-0000;
	Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaY-000000005vi-0000@the.local.host.name>
From: CALLER_NAME <CALLER@the.local.host.name>
Date: Tue, 2 Mar 1999 09:44:33 +0000

.
250 message received
QUIT
220 bye
End of script
Listening on port PORT_D ... 
Connection request from [127.0.0.1]
220 Hi there
EHLO the.local.host.name
250-yeah mate
250 LIMITS RCPTMAX=2
MAIL FROM:<CALLER@the.local.host.name>
250 mail cmd good
RCPT TO:<a@test.ex>
250 rcpt cmd 1 good
RCPT TO:<b@test.ex>
250 rcpt cmd 2 good
DATA
352 go ahead
Received: from CALLER by the.local.host.name with local (Exim x.yz)
	(envelope-from <CALLER@the.local.host.name>)
	id 10HmaZ-000000005vi-0000;
	Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaZ-000000005vi-0000@the.local.host.name>
From: CALLER_NAME <CALLER@the.local.host.name>
Date: Tue, 2 Mar 1999 09:44:33 +0000

.
250 message received
MAIL FROM:<CALLER@the.local.host.name>
250 mail cmd good
RCPT TO:<c@test.ex>
250 rcpt cmd 3 good
DATA
352 go ahead
Received: from CALLER by the.local.host.name with local (Exim x.yz)
	(envelope-from <CALLER@the.local.host.name>)
	id 10HmaZ-000000005vi-0000;
	Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaZ-000000005vi-0000@the.local.host.name>
From: CALLER_NAME <CALLER@the.local.host.name>
Date: Tue, 2 Mar 1999 09:44:33 +0000

.
250 message received
QUIT
220 bye
End of script
Listening on port PORT_D ... 
Connection request from [127.0.0.1]
220 Hi there
EHLO the.local.host.name
250-yeah mate
250 LIMITS RCPTMAX=3
MAIL FROM:<CALLER@the.local.host.name>
250 mail cmd good
RCPT TO:<a@test.ex>
250 rcpt cmd 1 good
RCPT TO:<b@test.ex>
250 rcpt cmd 2 good
DATA
352 go ahead
Received: from CALLER by the.local.host.name with local (Exim x.yz)
	(envelope-from <CALLER@the.local.host.name>)
	id 10HmbA-000000005vi-0000;
	Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmbA-000000005vi-0000@the.local.host.name>
From: CALLER_NAME <CALLER@the.local.host.name>
Date: Tue, 2 Mar 1999 09:44:33 +0000

.
250 message received
QUIT
220 bye
Expected EOF read from client
Listening on port PORT_D ... 
Connection request from [127.0.0.1]
220 Hi there
EHLO the.local.host.name
250-yeah mate
250 LIMITS RCPTMAX=3
MAIL FROM:<CALLER@the.local.host.name>
250 mail cmd good
RCPT TO:<c@test.ex>
250 rcpt cmd 3 good
DATA
352 go ahead
Received: from CALLER by the.local.host.name with local (Exim x.yz)
	(envelope-from <CALLER@the.local.host.name>)
	id 10HmbA-000000005vi-0000;
	Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmbA-000000005vi-0000@the.local.host.name>
From: CALLER_NAME <CALLER@the.local.host.name>
Date: Tue, 2 Mar 1999 09:44:33 +0000

.
250 message received
QUIT
220 bye
End of script
