
******** SERVER ********
Listening on port 1225 ... 
Connection request from [127.0.0.1]
220 Hi there
EHLO the.local.host.name
250-yeah mate
250 LIMITS RCPTMAX=1
MAIL FROM:<CALLER@the.local.host.name>
250 mail cmd 1 good
RCPT TO:<a@test.ex>
250 rcpt cmd good
DATA
352 go ahead
Received: from CALLER by the.local.host.name with local (Exim x.yz)
	(envelope-from <CALLER@the.local.host.name>)
	id 10HmaX-0005vi-00;
	Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaX-0005vi-00@the.local.host.name>
From: CALLER_NAME <CALLER@the.local.host.name>
Date: Tue, 2 Mar 1999 09:44:33 +0000

.
250 message received
MAIL FROM:<CALLER@the.local.host.name>
250 mail cmd 2 good
RCPT TO:<b@test.ex>
250 rcpt cmd good
DATA
352 go ahead
Received: from CALLER by the.local.host.name with local (Exim x.yz)
	(envelope-from <CALLER@the.local.host.name>)
	id 10HmaX-0005vi-00;
	Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaX-0005vi-00@the.local.host.name>
From: CALLER_NAME <CALLER@the.local.host.name>
Date: Tue, 2 Mar 1999 09:44:33 +0000

.
250 message received
QUIT
220 bye
End of script
Listening on port 1225 ... 
Connection request from [127.0.0.1]
220 Hi there
EHLO the.local.host.name
250-yeah mate
250 LIMITS RCPTMAX=1 MAILMAX=1
MAIL FROM:<CALLER@the.local.host.name>
250 mail cmd 1 good
RCPT TO:<a@test.ex>
250 rcpt cmd good
DATA
352 go ahead
Received: from CALLER by the.local.host.name with local (Exim x.yz)
	(envelope-from <CALLER@the.local.host.name>)
	id 10HmaY-0005vi-00;
	Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaY-0005vi-00@the.local.host.name>
From: CALLER_NAME <CALLER@the.local.host.name>
Date: Tue, 2 Mar 1999 09:44:33 +0000

.
250 message received
QUIT
220 bye
Expected EOF read from client
Listening on port 1225 ... 
Connection request from [127.0.0.1]
220 Hi there
EHLO the.local.host.name
250-yeah mate
250 LIMITS RCPTMAX=1 MAILMAX=1
MAIL FROM:<CALLER@the.local.host.name>
250 mail cmd 2 good
RCPT TO:<b@test.ex>
250 rcpt cmd good
DATA
352 go ahead
Received: from CALLER by the.local.host.name with local (Exim x.yz)
	(envelope-from <CALLER@the.local.host.name>)
	id 10HmaY-0005vi-00;
	Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaY-0005vi-00@the.local.host.name>
From: CALLER_NAME <CALLER@the.local.host.name>
Date: Tue, 2 Mar 1999 09:44:33 +0000

.
250 message received
QUIT
220 bye
End of script
