220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaX-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaY-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaZ-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbA-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
550 Administrative prohibition
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbB-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
550 Administrative prohibition
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbC-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbD-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbE-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbF-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbG-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbH-0005vi-00
221 myhost.test.ex closing connection

******** SERVER ********
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userx@domain.com>
250 Recipient OK
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmaX-0005vi-00
	for userx@domain.com; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaX-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
250 OK
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 SMTP only spoken here
EHLO myhost.test.ex
550 Not here, mate
HELO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userz@domain.com>
250 Recipient OK
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmaY-0005vi-00
	for userz@domain.com; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaY-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
250 OK
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<usery@domain.com>
250 Recipient OK
RCPT TO:<userx@domain.com>
250 Recipient OK
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmaZ-0005vi-00; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaZ-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
250 OK
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userx@domain.com>
250 Recipient OK
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmbA-0005vi-00
	for userx@domain.com; Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-tpt: zzz
Message-Id: <E10HmbA-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++


body
.
250 OK
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<no@domain.com>
550 Not that one
QUIT
250 OK
Expected EOF read from client
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<>
250 Sender OK
RCPT TO:<userx@domain.com>
250 ok rcpt-1
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmbB-0005vi-00
	for userx@domain.com; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmbB-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
250 OK
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userx@domain.com>
250 first recipient ok
RCPT TO:<no@domain.com>
550 Not that one
QUIT
250 OK
Expected EOF read from client
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<>
250 Sender OK
RCPT TO:<userx@domain.com>
250 ok rcpt-1
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmbC-0005vi-00
	for userx@domain.com; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmbC-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
250 OK
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userx@domain.com>
250 first recipient ok
QUIT
250 OK
Expected EOF read from client
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<special_tpt@domain.com>
250 second recipient ok
QUIT
250 OK
Expected EOF read from client
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<>
250 Sender OK
RCPT TO:<userx@domain.com>
250 ok rcpt-1
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmbD-0005vi-00; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmbD-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
250 OK
QUIT
250 OK
Expected EOF read from client
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<>
250 Sender OK
RCPT TO:<special_tpt@domain.com>
250 ok rcpt-2
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmbD-0005vi-00; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmbD-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
250 OK
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userx@domain1.com>
250 ok rcpt-1
RCPT TO:<usery@domain2.com>
250 ok rcpt-2
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmbE-0005vi-00; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmbE-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
250 OK
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userx@domain.com>
250 first recipient ok
QUIT
250 OK
Expected EOF read from client
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<usery@special.com>
250 second recipient ok
QUIT
250 OK
Expected EOF read from client
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<>
250 Sender OK
RCPT TO:<userx@domain.com>
250 ok rcpt-1
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmbF-0005vi-00; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmbF-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
250 OK
QUIT
250 OK
Expected EOF read from client
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<>
250 Sender OK
RCPT TO:<usery@special.com>
250 ok rcpt-2
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmbF-0005vi-00; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmbF-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
250 OK
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userx@localhost4.test.ex>
250 ok rcpt-1
RCPT TO:<usery@thishost.test.ex>
250 ok rcpt-2
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmbG-0005vi-00; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmbG-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000

.
250 OK
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userx@domain.com>
250 Recipient OK
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmbH-0005vi-00
	for userx@domain.com; Tue, 2 Mar 1999 09:44:33 +0000
Subject: singledot test
Message-Id: <E10HmbH-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

This data has a line with a single dot... next:
..
and this is the line right after.
Next we have a line with a leading dot:
..test
and this is the next line.

.
250 OK
QUIT
250 OK
End of script
