220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaX-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaY-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaZ-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
450 not right now
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbA-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbB-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
459 content reject
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
450 Onward transmission not accepted
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmbD-0005vi-00
221 myhost.test.ex closing connection
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250-myhost.test.ex Hello CALLER at myhost.test.ex
250-SIZE 52428800
250-8BITMIME
250-PIPELINING
250 HELP
250 OK
451 Could not complete recipient verify callout
503-All RCPT commands were rejected with this error:
503-Could not complete recipient verify callout
503 Valid RCPT command must precede DATA
500 unrecognized command
500 unrecognized command
221 myhost.test.ex closing connection

******** SERVER ********
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<usera@domain.com>
250 Recipient OK
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmaX-0005vi-00
	for usera@domain.com; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaX-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
250 OK
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userb@domain.com>
450 not right now
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userc@domain.com>
450 not right now
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userd@domain.com>
450 not right now
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<usere@domain.com>
250 good rcpt
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmbA-0005vi-00
	for usere@domain.com; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmbA-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
459 content reject
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userf@domain.com>
250 good rcpt
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmbB-0005vi-00
	for userf@domain.com; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmbB-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
459 content reject
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userg@domain.com>
250 good rcpt
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmbC-0005vi-00
	for userg@domain.com; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmbC-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
459 content reject
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userj@domain.com>
250 good rcpt
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmbE-0005vi-00
	for userj@domain.com; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmbE-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
>*eof
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<userh@domain.com>
250 Recipient OK
DATA
354 Send data
Received: from CALLER (helo=myhost.test.ex)
	by myhost.test.ex with local-esmtp (Exim x.yz)
	(envelope-from <CALLER@myhost.test.ex>)
	id 10HmbD-0005vi-00
	for userh@domain.com; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmbD-0005vi-00@myhost.test.ex>
From: CALLER_NAME <CALLER@myhost.test.ex>
Date: Tue, 2 Mar 1999 09:44:33 +0000
X-hdr-rtr-new: +++

.
250 OK
QUIT
250 OK
End of script
Listening on port 1224 ... 
Connection request from [ip4.ip4.ip4.ip4]
220 ESMTP
EHLO myhost.test.ex
250 OK
MAIL FROM:<CALLER@myhost.test.ex>
250 Sender OK
RCPT TO:<useri@domain.com>
450 not right now
QUIT
250 OK
End of script
