Message 10HmbE-0005vi-00 has been removed

******** SERVER ********
Listening on port 1224 ... 
Connection request from [127.0.0.1]
220 ESMTP
EHLO the.local.host.name
250-OK
250 HELP
MAIL FROM:<>
250 OK
RCPT TO:<userx@domain1>
250 OK
DATA
354 More...
Received: from CALLER by the.local.host.name with local (Exim x.yz)
	(envelope-from <CALLER@the.local.host.name>)
	id 10HmaY-0005vi-00
	for userx@domain1; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaY-0005vi-00@the.local.host.name>
From: CALLER_NAME <CALLER@the.local.host.name>
Date: Tue, 2 Mar 1999 09:44:33 +0000

A deliverable message
.
250 OK
QUIT
220 OK
End of script
Listening on port 1224 ... 
Connection request from [127.0.0.1]
220 ESMTP
EHLO the.local.host.name
250-OK
250 HELP
MAIL FROM:<>
250 OK
RCPT TO:<userx@domain2>
250 OK
DATA
354 More...
Received: from CALLER by the.local.host.name with local (Exim x.yz)
	(envelope-from <CALLER@the.local.host.name>)
	id 10HmaX-0005vi-00
	for userx@domain2; Tue, 2 Mar 1999 09:44:33 +0000
Message-Id: <E10HmaX-0005vi-00@the.local.host.name>
From: CALLER_NAME <CALLER@the.local.host.name>
Date: Tue, 2 Mar 1999 09:44:33 +0000

A deliverable message which will hit a coding error in the config
.
250 OK
QUIT
220 OK
End of script
Listening on port 1224 ... 
Connection request from [127.0.0.1]
220 ESMTP
EHLO the.local.host.name
*sleep 4
End of script
Listening on port 1224 ... 
Connection request from [127.0.0.1]
220 ESMTP
EHLO the.local.host.name
250-OK
250 HELP
MAIL FROM:<>
250 OK
RCPT TO:<userx@domain1>
450 NOT RIGHT NOW
QUIT
220 OK
End of script
Listening on port 1224 ... 
Connection request from [127.0.0.1]
220 ESMTP
EHLO the.local.host.name
250-OK
250 HELP
MAIL FROM:<>
250 OK
RCPT TO:<userx@domain1>
550 GO AWAY
QUIT
220 OK
End of script
