Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> HELO nonexistent.test.ex
??? 250
<<< 250 myhost.test.ex Hello nonexistent.test.ex [127.0.0.1]
>>> MAIL FROM:<a@b>
??? 250
<<< 250 OK
>>> RCPT TO:<c@d>
??? 550
<<< 550 Administrative prohibition
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> HELO badcname.test.ex
??? 250
<<< 250 myhost.test.ex Hello badcname.test.ex [127.0.0.1]
>>> MAIL FROM:<a@b>
??? 250
<<< 250 OK
>>> RCPT TO:<c@d>
??? 550
<<< 550 Administrative prohibition
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> HELO test.again.dns
??? 250
<<< 250 myhost.test.ex Hello test.again.dns [127.0.0.1]
>>> MAIL FROM:<a@b>
??? 250
<<< 250 OK
>>> RCPT TO:<c@d>
??? 550
<<< 550 Administrative prohibition
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port PORT_D ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> HELO localhost
??? 250
<<< 250 myhost.test.ex Hello localhost [127.0.0.1]
>>> MAIL FROM:<a@b>
??? 250
<<< 250 OK
>>> RCPT TO:<bad_A@nonexistent.test.ex>
??? 250 Accepted
<<< 250 Accepted
>>> DATA
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Subject: test
>>> .
??? 250
<<< 250 OK id=10HmaX-000000005vi-0000
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
